{
  "Games": [
    {
      "id": 134128,
      "title": "Preview The Elder Scrolls Online's New Necrom Chapter In Upcoming Livestream",
      "short_description": "Bethesda and the Community Team will uncover Hermaeus Mora’s mysteries on Twitch real soon.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/eso-pocket-watcher-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/eso-pocket-watcher.jpg",
      "article_content": "<p>&lt;img src='https://www.mmobomb.com/file/2023/4/eso-pocket-watcher-812x456.jpg' class='type:primaryImage aligncenter size-large' alt='eso pocket watcher' width='812' height='456'/&gt;</p>\r\n<p>The Necrom Chapter is almost here, so in the meantime <a href=\"https://www.mmobomb.com/topic/the-elder-scrolls-online\">Elder Scrolls Online</a> players can check out what to be excited for via Bethesda’s Preview Event.</p>\r\n<p>Hermaeus Mora’s mysteries will be uncovered on April 12 at 1 P.M. PDT (4 P.M. EDT) on the publisher’s Twitch channel (twitch.tv/Bethesda). The developers behind the MMORPG and the Community Team will dive into not only the upcoming expansion but also Telvanni Peninsula, Apocrypha — the Arcanist class, the 12-player Trial, and more. Those who watch will even earn a free Ouroboros Crate plus a Moon and Star Earring adornment for their in-game character.</p>\r\n<p>(Consult the official website post for other supporting special live streams happening as well.)</p>\r\n<p>The Elder Scrolls Online: Necrom is part of the Shadow Over Morrowind adventure and launches for PC on June 5 and for Xbox/PlayStation on June 20.</p>",
      "article_url": "https://www.mmobomb.com/news/preview-elder-scrolls-online-new-necrom-chapter-upcoming-livestream"
    },
    {
      "id": 134127,
      "title": "Star Trek Online Celebrates “First Contact Day” Once Again With A Special Event",
      "short_description": "Players can launch into space with Phoenix Rockets to fight Borg and recreate the Synth attack on Mars.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/star-trek-online-chronogami-time-portal-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/star-trek-online-chronogami-time-portal.jpg",
      "article_content": "<p>&lt;img src='https://www.mmobomb.com/file/2023/4/star-trek-online-chronogami-time-portal-812x456.jpg' class='type:primaryImage aligncenter size-large' alt='star trek online Chronogami Time Portal' width='812' height='456'/&gt;</p>\r\n<p>Yesterday, April 5, was “First Contact Day” — an informal commemorative occasion celebrated by Star Trek fans across the universe in honor of the media franchise.</p>\r\n<p>And so the First Contact Day Celebration festivities begin once again in <a href=\"https://www.mmobomb.com/review/star-trek-online\">Star Trek Online</a> from April 12 to May 3. Players can team up in groups of four in Cryptic Studios' MMORPG to launch Phoenix Rockets that take them back to 2063 so they may fight back against Borg or participate in a recreation of the Synth attack on Mars. The grand prize, achieved through 14-day daily progress, is the Universal Console - Chronogami Time Portal.</p>\r\n<p>Furthermore, players may continue to earn scaling Dilithium Ore bonus rewards following completion of the event. With each completion, they’ll get 8,000. And those who don’t have time can spend Zen to make up for any lost progress. </p>\r\n<p>For more details, head over to <a href=\"https://www.playstartrekonline.com/en/news/article/11541003\">the official website post</a>.</p>",
      "article_url": "https://www.mmobomb.com/news/star-trek-online-celebrates-first-contact-day-once-special-event"
    },
    {
      "id": 134126,
      "title": "Fresh Progression Server Coming To EverQuest, Plus A New UI Engine",
      "short_description": "Also, more Tempest Festival content coming soon and Pride Month familiars are returning.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/everquest-progression-server-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/everquest-progression-server.jpg",
      "article_content": "<p>&lt;img src='https://www.mmobomb.com/file/2023/4/everquest-progression-server-812x456.jpg' class='type:primaryImage aligncenter size-large' alt='everquest progression server' width='812' height='456'/&gt;</p>\r\n<p>Norrathians, check this out! Daybreak Games announced what’s on the way for <a href=\"https://www.mmobomb.com/review/everquest\">EverQuest</a>.</p>\r\n<p>In the “Producer’s Letter April 2023,” the team behind the MMORPG said the new UI Engine for the game releases in April, more Tempest Festival content is arriving in May, and Pride Month familiars are returning come June.</p>\r\n<p>Also in May, the Evolving Ruleset Progression Server — Oakwynd — launches. The server will start with Legacy characters and encounter locking, with additional bonuses (such as a 125% modifier to the normal loot rate and faction changes) being added at each expansion unlock. Legacy characters allow players to receive a semi-permanent experience bonus for all characters on the same account on the server. Encounter locking means that once an NPC is engaged, it will be locked to that character, group, or raid.</p>\r\n<p>Like other progression servers, Oakwynd will follow a \"Standard Unlock\" schedule, where new expansions will automatically unlock every 8-12 weeks. However, earlier expansions will unlock at a faster rate. Also, the server will launch with only a standard True Box, meaning just one EverQuest client can be run per computer. However, when Omens of War is unlocked, the server will switch to a Relaxed True Box, allowing up to three clients per computer to be logged in simultaneously. Finally, when The Buried Sea is unlocked, the True Box restriction will be removed altogether.</p>\r\n<p>Peep the official website post for more information, such as the developers thanking players as their 24th Anniversary just passed.</p>",
      "article_url": "https://www.mmobomb.com/news/fresh-progression-server-coming-to-everquest-plus-new-ui-engine"
    },
    {
      "id": 134125,
      "title": "It Appears World Of Warcraft is Getting A Diablo 4 Crossover",
      "short_description": " Likely just in time for the Diablo 4 launch",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/diablo-wow-crossover-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/diablo-wow-crossover.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/diablo-wow-crossover-812x456.jpg\" alt=\"Diablo WoW Crossover\" width=\"812\" height=\"456\" /></p>\r\n<p>On June 6, Blizzard will be dropping the next installment in the Diablo series, Diablo 4. It seems like they’ll be giving <a title=\"World of Warcraft Topic\" href=\"https://www.mmobomb.com/topic/world-of-warcraft\">World of Warcraft</a> players a way to celebrate that release with an in-game crossover. That is, according to some datamined information from the latest PTR, shared on <a title=\"World Of Warcraft Diablo Crossover Icy Veins\" href=\"https://www.icy-veins.com/forums/topic/72137-diablo-4-launch-event-in-world-of-warcraft-xp-buff-battle-pet-treasure-goblins-and-more/\" target=\"_blank\" rel=\"noopener\">Icy Veins</a>.</p>\r\n<p>According to the post, flavor text found in the PTR build indicates a return of Diablo's goblins to the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a>. Among the things included may be the Baa’lial Soulstone, needed for learning the Baa’lial battle pet, as well as a feat of strength related to it.</p>\r\n<p>Also found in the flavor text is a tooltip describing the event, stating: “Strange winds blow in from another world. Sightings of odd, bag-holding creatures spot the land, and heroes are filled with renewed vigor. Treasure Goblins can be spotted from TBD to TBD. The Winds of Sanctuary blow in from TBD to TBD.” Winds of Sanctuary is a 50% XP buff.</p>\r\n<p><em style=\"box-sizing: border-box; color: #3e3f3a; font-family: Roboto, sans-serif; font-size: 16px; text-align: justify; background-color: #ffffff;\"><span style=\"box-sizing: border-box; font-weight: bolder;\">Note:</span> Activision Blizzard has had <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/activision-blizzard-sued-state-california-harassment-claims\" target=\"_blank\" rel=\"noopener\">charges filed against them by the state of California for serious harassment allegations</a>. CEO Bobby Kotick <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/wsj-investigation-alleges-that-kotick-knew-about-hid-sexual-harassment-activision-blizzard-years\" target=\"_blank\" rel=\"noopener\">is alleged to have known</a> about such actions within his company – and had separate allegations made against him in 2006 and 2007 – and in many employees' eyes failed to take adequate action. These allegations have all been denied by Activision Blizzard and the company points to additional diversity and inclusion training as past examples of taking the accusations seriously at the time they were made.</em></p>",
      "article_url": "https://www.mmobomb.com/news/it-appears-world-of-warcraft-getting-diablo-4-crossover"
    },
    {
      "id": 134124,
      "title": "Pre-Registration For Tree Of Savior Now Open On Papaya Play",
      "short_description": "Score another MMORPG for the service.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/tree-of-savior-pre-registration-open-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/tree-of-savior-pre-registration-open.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/tree-of-savior-pre-registration-open-812x456.jpg\" alt=\"Tree of Savior pre-registration open\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.mmobomb.com/topic/tree-of-savior\" target=\"_blank\" rel=\"noopener\">Tree of Savior</a> pre-registration is now open as the game is set to launch on Papaya Play later this year. All you need to do is head over to the <a href=\"https://www.papayaplay.com//tosevent/prevent.do?tp=home\" target=\"_blank\" rel=\"noopener\">pre-registration page</a> and sign up. Players who pre-register will receive a variety of items for their character once the game goes live on Papaya Play.</p>\r\n<p>Tree of Savior boats over 60 different classes for you to play, while character models are fully rendered in a hand-drawn art style.</p>\r\n<p>Aspen took a look at the Tree of Savior <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> in her Cozy Comfort Multiplayer series and you can check out that article <a href=\"https://www.mmobomb.com/cozy-comfy-multiplayer-look-tree-of-savior-2023-should-you-play\" target=\"_blank\" rel=\"noopener\">here</a>.</p>\r\n<p>Tree of Savior is scheduled to launch on PapayaPlay in the first half of 2023.</p>\r\n<p>You can also check out the new global launch promotion trailer below.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/zlxCxs6Xaas\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/pre-registration-tree-of-savior-now-open-papayaplay"
    },
    {
      "id": 134123,
      "title": "League Of Legends Queue Times Have Gotten Ridiculous For Some Players Following Matchmaking Changes",
      "short_description": "The removal of Autofill is causing some issues.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/league-of-legends-removes-autofill-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/league-of-legends-removes-autofill.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/league-of-legends-removes-autofill-812x456.jpg\" alt=\"League of Legends removes autofill\" width=\"812\" height=\"456\" /></p>\r\n<p>In the latest patch for <a href=\"https://www.mmobomb.com/review/league-of-legends\" target=\"_blank\" rel=\"noopener\">League of Legends</a>, Riot decided to try a little experiment on the <a href=\"https://www.mmobomb.com/games/moba\" target=\"_blank\" rel=\"noopener\">MOBA</a>'s EU North East, Oceania, and Russian servers. They have removed  \"Autofill\" from the matchmaking queue, meaning players are being matched up solely based on their primary and secondary role choices. While Autofill can sometimes lead to players being assigned roles they may not have wanted, it did help move matchmaking along at a quicker pace.</p>\r\n<p>As pointed out by <a href=\"https://www.gamesradar.com/league-of-legends-players-say-theyre-waiting-up-to-30x-longer-for-a-game-after-matchmaking-changes/\" target=\"_blank\" rel=\"noopener\">Games Radar</a>, players in these regions are now reporting queue times substantially longer than they were before the removal of Autofill. <a href=\"https://www.reddit.com/r/leagueoflegends/comments/12cbcyp/the_experimental_queueing_changes_on_oce_eune_and/\" target=\"_blank\" rel=\"noopener\">One post</a> from Reddit claims a three-stack of players were waiting over two hours in the queue. <a href=\"https://www.reddit.com/r/leagueoflegends/comments/12cdwdk/new_auto_fill_changes/\" target=\"_blank\" rel=\"noopener\">Another</a> was queueing for an hour and a half, changing around their secondary role choice to try to hasten the process.</p>\r\n<p>It's still early days of testing the matchmaking system without Autofill in League of Legends, so we'll have to wait and see what Riot's next step is, but so far it sounds like Autofill may be the necessary evil that makes matchmaking work within a reasonable amount of time.</p>",
      "article_url": "https://www.mmobomb.com/news/league-of-legends-queue-times-have-gotten-ridiculous-some-players-following-matchmaking-changes"
    },
    {
      "id": 134122,
      "title": "Call Of Duty Trailer Announces New Season 3 Game Modes And More For Warzone 2 and Modern Warfare 2",
      "short_description": "It's Alejandro vs. Valeria, and two new game modes.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/call-of-duty-alejandro-vs-valeria-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/call-of-duty-alejandro-vs-valeria.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/call-of-duty-alejandro-vs-valeria-812x456.jpg\" alt=\"Call of Duty Alejandro vs Valeria\" width=\"812\" height=\"456\" /></p>\r\n<p>The latest <a href=\"https://www.mmobomb.com/topic/call-of-duty-modern-warfare-2\" target=\"_blank\" rel=\"noopener\">Call of Duty</a> trailer landed today and with it comes a few exciting tidbits. Season 3 is about Alejandro vs. Valeria, with each looking to be a playable character for the season.</p>\r\n<p>Along with this, the new Call of Duty trailer announced two new game modes being added to the <a href=\"https://www.mmobomb.com/games/shooter\" target=\"_blank\" rel=\"noopener\">shooters</a>; Cranked and Gunfight. Cranked is a fast-paced game mode where players must chain together kills in order to keep from exploding. Gunfight is a 2v2 game mode played over a series of quick rounds on small maps. Also being added is the money-based Plunder mode from Warzone 1.</p>\r\n<p>Call of Duty: Modern Warfare 2 and Warzone 2 Season 3 is going live on April 12.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/C04Oj2yEynY\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/call-of-duty-trailer-announces-new-game-modes-more-warzone-2-modern-warfare-2"
    },
    {
      "id": 134121,
      "title": "Phantasy Star Online 2 New Genesis Takes Players To The Floating Island Of Luceil",
      "short_description": "The update drops today and sets the stage for the Slayer class’s arrival.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/pso2-ngs-update-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/pso2-ngs-update.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/pso2-ngs-update-812x456.jpg\" alt=\"PSO2 NGS Update\" width=\"812\" height=\"456\" /></p>\r\n<p>Today, Sega dropped the latest update in <a title=\"Phantasy Star Online 2: New Genesis Game Page\" href=\"https://www.mmobomb.com/review/phantasy-star-online-2-new-genesis\">Phantasy Star Online 2: New Genesis</a>, introducing a new region to the game and preparing things for the arrival of the Slayer class in the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> on April 12. The new region is a huge floating island named “Luceil”. How players will get there and what they will find is a mystery, but everyone’s <a title=\"Phantasy Star Online 2: New Genesis Update\" href=\"https://pso2.com/players/update/2023-04/\" target=\"_blank\" rel=\"noopener\">about to find out</a>.</p>\r\n<p>As for the new class, things are already in motion with the arrival of the Gunblade weapon category. Players won’t be able to equip this weapon yet, but at least they’ll have it when the time comes – provided they complete a series of tasks from Instructor Slaine. In addition, in the exchange shop, players can pick up the Slayer Operation Prep Ticket Exchange to trade in for Gunblades, weapon camo and other items.</p>",
      "article_url": "https://www.mmobomb.com/news/phantasy-star-online-2-new-genesis-takes-players-to-floating-island-of-luceil"
    },
    {
      "id": 134120,
      "title": "Twin Class Maegu Arrives On Black Desert Console Today",
      "short_description": "Learn to fight enemies with the Maegu’s Fox Charm.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/black-desert-console-maegu-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/black-desert-console-maegu.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/black-desert-console-maegu-812x456.jpg\" alt=\"Black Desert Console Maegu\" width=\"812\" height=\"456\" /></p>\r\n<p>Today’s the day. As promised, <a title=\"Black Desert Topic\" href=\"https://www.mmobomb.com/topic/black-desert\">Black Desert</a> Console's new twin class, Maegu, has arrived on Xbox and PlayStation. Maegu wields the mystical “Do” and uses Fox Charm moves and abilities. With her launch on consoles, players can now grow her and other characters using the Seasonal Servers. This allows them to make use of milestone-based rewards, Hot-Time buffs, and seasonal challenges in order to progress. Players will also receive rewards when they graduate their class.</p>\r\n<p>In addition, Maegu also arrives alongside the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a>'s spring sales on both console systems. The Xbox’s sale runs from April 6 to April 20. PlayStation users will be able to take advantage of the deals through April 12. During this time, players will be able to get as much as 80% off certain packages in the store.</p>",
      "article_url": "https://www.mmobomb.com/news/twin-class-maegu-arrives-black-desert-console-today"
    },
    {
      "id": 134119,
      "title": "Is It An MMO? #4 — Tower Of Fantasy Is Genshin Impact But With Actual MMO Elements",
      "short_description": "The \"shared\" open world allows players to fight bosses together and form guilds with complete strangers.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/tower-of-fantasy-town-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/tower-of-fantasy-town.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/tower-of-fantasy-town-812x456.jpg\" alt=\"tower of fantasy town\" width=\"812\" height=\"456\" /></p>\r\n<p>The characterization of a massively multiplayer online game, or <a href=\"https://www.mmobomb.com/games\" target=\"_blank\" rel=\"noopener\">MMO</a>, is self-explanatory. Or is it? By definition, it means a large number of players on the same server — hundreds, thousands — and a big open world that continues to evolve. So does <a href=\"https://www.mmobomb.com/review/tower-of-fantasy\" target=\"_blank\" rel=\"noopener\">Tower of Fantasy</a>, developed by Hotta Studio (a subsidiary of Perfect World, the company that made the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> of the same name), make the cut?</p>\r\n<p>Let’s address the elephant in the room first. This game is self-defined as an open world, action RPG, not an MMO (according to the main description on the official Steam page). And while we’re at it, let’s address the other elephant: Tower of Fantasy looks a heck of a lot like <a href=\"https://www.mmobomb.com/review/genshin-impact\">Genshin Impact</a>. However, even though both games find themselves in the same genre, they are actually vastly different when it comes to our most important thing: multiplayer.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/tower-of-fantasy-boss-812x456.jpg\" alt=\"tower of fantasy boss\" width=\"812\" height=\"456\" /></p>\r\n<p>Genshin Impact allows only up to four players to adventure with each other in the same instance. They have to be friends before even teaming up or go through random matchmaking. On the other hand, Tower of Fantasy permits 50 players. And they are all strangers, wandering around just like the player themself.</p>\r\n<p>That’s because the open world is “shared,” so players will run into others and have the option to interact — partying up to fight alongside one another or perhaps dueling each other in PvP. You can also encounter other players taking down a boss and jump in on the action. There’s a chat feature, too.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/tower-of-fantasy-social-812x456.jpg\" alt=\"tower of fantasy social\" width=\"812\" height=\"456\" /></p>\r\n<p>On top of that, the game offers co-op PvE modes like four-player dungeons and eight-person raids. Both can be entered with a group of random players through matchmaking. That being said, if uncoordinated teamwork isn’t your thing, Tower of Fantasy features the classic guild system we all know and love. </p>\r\n<p>Taking everything into account, the game is clearly not in the same league as Genshin Impact. It has way more social elements, or rather, MMO elements. But is Tower of Fantasy a true MMO? No, I suppose not. But when you consider the ability to run into other players, do dungeons together with strangers, join a guild, and argue with people across the world in the chat? Seems like some-kind-of MMO to me.</p>",
      "article_url": "https://www.mmobomb.com/is-an-mmo-4-tower-of-fantasy-genshin-impact-but-actual-mmo-elements"
    },
    {
      "id": 134117,
      "title": "Amazon Games Lays Off About 100 Employees, Contributing To The Thousands Already This Year Amazon Wide",
      "short_description": "\"But we are committed to treating our impacted employees with empathy and respect.\"",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/amazon-games-logo-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/amazon-games-logo.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/amazon-games-logo-812x456.jpg\" alt=\"amazon games logo\" width=\"812\" height=\"456\" /></p>\r\n<p>More layoffs? More layoffs.</p>\r\n<p>Amazon Games is laying off around 100 employees from its Game Growth group, the gaming studio in San Diego, and Prime Gaming. This news comes from a memo to staffers yesterday by the company’s vice president Christoph Hartmann.</p>\r\n<p>“There is never a pleasant way to share this sort of news, but we are committed to treating our impacted employees with empathy and respect, and will support them by offering them severance pay, health insurance benefits, outplacement services, and paid time to conduct their job search,” he said.</p>\r\n<p>The employees were told that they were being laid off one-by-one through meetings with human resources. A spokesperson for Amazon confirmed the layoffs to CNBC and the existence of the memo, but declined further comment.</p>\r\n<p>Recently, <a href=\"https://www.mmobomb.com/news/amazon-to-lay-off-9-000-employees-most-of-which-work-twitch\">Amazon laid off 9,000 employees,</a> and just this past January, 18,000 others were cut. Andy Jassy, the new CEO, is now in charge after former head and Twitch co-founder Emmett Shear resigned on March 16.</p>\r\n<p>Also, Mike Frazzini, who helped launch Amazon Games, stepped down last March. And last January, former head of the San Diego gaming studio John Smedley left the company.</p>\r\n<p>Yeah, there's been a lot of departures lately.</p>",
      "article_url": "https://www.mmobomb.com/news/amazon-games-lays-off-100-employees-contributing-to-thousands-already-this-year"
    },
    {
      "id": 134116,
      "title": "Blizzard Reveals New Support Hero Lifeweaver, Overwatch 2's First Pansexual Character",
      "short_description": "Niran PruksaManee hails from Thailand and specializes in plant-based technology.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/overwatch-2-lifeweaver-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/overwatch-2-lifeweaver.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/overwatch-2-lifeweaver-812x456.jpg\" alt=\"overwatch 2 lifeweaver\" width=\"812\" height=\"456\" /></p>\r\n<p>“Leaf this to me,” says Lifeweaver, <a href=\"https://www.mmobomb.com/review/overwatch-2\">Overwatch 2’s</a> new hero that was just revealed.</p>\r\n<p>Niran \"Lifeweaver\" PruksaManee is the 37th character in Blizzard’s <a href=\"https://www.mmobomb.com/games/shooter\" target=\"_blank\" rel=\"noopener\">shooter</a>. The support hero specializes in plant-based technology. He is a fugitive on the run from the Vishkar Corporation and has a close relationship with Symmetra, as they both attended the company's Architech Academy. Niran is also Thai, and the first character in the game to come from Thailand.</p>\r\n<p>Another unique aspect: He is Overwatch’s first openly pansexual character. Niran's pansexuality is even reflected in the game through phrases and conversations with other heroes. He joins two other queer characters; Tracer is a lesbian and Soldier: 76 is gay.</p>\r\n<p>As for Lifeweaver’s kit, his primary fire — Healing Blossom — heals characters through charged bursts, while the secondary fire — Thorn Valley — shoots streams of projectile thorns that may deal critical damage. He’s got one ability called Petal Platform that deploys a bouncy block for anyone to use and another called Rejuvenating Dash that allows Lifeweaver to quickly move horizontally (plus heal himself). </p>\r\n<p>Aside from the above, there’s Life Grip. This ability pulls an ally towards Lifeweaver, along with throwing a protective bubble around them. And when he dies, he drops a “Parting Gift” that heals whoever picks it up — teammate or enemy. </p>\r\n<p>Last but not least, Lifeweaver’s ultimate is Tree of Life. He places a giant tree of luminescence that blocks incoming fire from enemies while healing allies nearby.</p>\r\n<p>Lifeweaver will be available to play really soon, when Season 4 begins on April 11.</p>\r\n<p><em style=\"box-sizing: border-box; color: #3e3f3a; font-family: Roboto, sans-serif; font-size: 16px; text-align: justify; background-color: #ffffff;\"><span style=\"box-sizing: border-box; font-weight: bolder;\">Note:</span> Activision Blizzard has had <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/activision-blizzard-sued-state-california-harassment-claims\" target=\"_blank\" rel=\"noopener\">charges filed against them by the state of California for serious harassment allegations</a>. CEO Bobby Kotick <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/wsj-investigation-alleges-that-kotick-knew-about-hid-sexual-harassment-activision-blizzard-years\" target=\"_blank\" rel=\"noopener\">is alleged to have known</a> about such actions within his company – and had separate allegations made against him in 2006 and 2007 – and in many employees' eyes failed to take adequate action. These allegations have all been denied by Activision Blizzard and the company points to additional diversity and inclusion training as past examples of taking the accusations seriously at the time they were made.</em></p>\r\n<p><iframe src=\"https://www.youtube.com/embed/ivDAI-FXMH4\" title=\"Lifeweaver | New Hero Gameplay Trailer | Overwatch 2\" width=\"1519\" height=\"545\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/blizzard-reveals-new-support-hero-lifeweaver-overwatch-2-first-pansexual-character"
    },
    {
      "id": 134118,
      "title": "Sign Up Now For Spellcraft Public Alpha On Steam",
      "short_description": "Public Alpha begins April 6th.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/spellcraft-public-alpha-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/spellcraft-public-alpha.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/spellcraft-public-alpha-812x456.jpg\" alt=\"Spellcraft public alpha\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.mmobomb.com/topic/spellcraft\">Spellcraft</a>, the real-time battler where you actively command a team of heroes, is going into a Public Alpha on April 6th beginning at 11:00 a.m. Pacific.</p>\r\n<p>To sign up for your chance to play in the Public Alpha for Spellcraft you need to head over to the <a href=\"https://store.steampowered.com/app/1806210/Spellcraft/?utm_source=email&amp;utm_campaign=newsletter_a3a4\" target=\"_blank\" rel=\"noopener\">official Steam page</a> ASAP and get signed up. It sounds like access might be limited so you need to get signed up now if you're interested.</p>\r\n<p>The devs are promising new gameplay for those who have played in previous tests.</p>\r\n<p>Check out the video below to learn more about Spellcraft.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/9oBHPB4BfIw\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/sign-up-now-spellcraft-public-alpha-steam"
    },
    {
      "id": 134115,
      "title": "Broken Ranks’  New Boss Sidraga Has Awoken, And They Seem Pretty Angry",
      "short_description": " The new in-game instance arrived today.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/broken-ranks-update-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/broken-ranks-update.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/broken-ranks-update-812x456.jpg\" alt=\"Broken Ranks Update\" width=\"812\" height=\"456\" /></p>\r\n<p>Today, Whitemoon Games dropped a new update in <a title=\"Broken Ranks Topic\" href=\"https://www.mmobomb.com/topic/broken-ranks\">Broken Ranks</a>, adding a new endgame instance, quests, and a bit of a gear overhaul. Unlike previous updates, this one focuses on content for high-level characters. It won’t just be going in and beating up a big baddy, though. Get ready to work together on planning, solving puzzles…and beating up the big baddy. The new Sidraga’s instance is for characters level 135 or higher. Layers who complete it will receive five new legendary pieces of gear as their reward.</p>\r\n<p>In addition to the new instance. The update also adds a new sidequest for players level 66 or higher, a Spring event, and an overhaul of all gear in the game. The new gear customization system will allow players to insert any character-enhancing mods into their gear using “drifts”. This will offer players a new way to develop their characters and give them ways to try new things. More information on the update can be found on the <a title=\"Broken Ranks Update\" href=\"https://brokenranks.com/aktualnosci/update---skrzydlata-pani-i-reforma-sprzetu\" target=\"_blank\" rel=\"noopener\">Broken Ranks site</a>.</p>",
      "article_url": "https://www.mmobomb.com/news/broken-ranks-new-boss-sidraga-awoken"
    },
    {
      "id": 134114,
      "title": "Redfall Gives A Little Backstory To Layla & Features Her Abilities",
      "short_description": "Get to know Layla.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/redfall-layla-feature-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/redfall-layla-feature.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/redfall-layla-feature-812x456.jpg\" alt=\"Redfall Layla feature\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.ign.com/videos/redfall-exclusive-new-look-at-laylas-backstory-and-abilities-ign-first\" target=\"_blank\" rel=\"noopener\">IGN</a> has an exclusive video up showcasing the first hero in the upcoming co-op <a href=\"https://www.mmobomb.com/games/shooter\" target=\"_blank\" rel=\"noopener\">shooter</a> <a href=\"https://www.mmobomb.com/topic/redfall\" target=\"_blank\" rel=\"noopener\">Redfall</a>, and this one is focused on Layla.</p>\r\n<p>In the video, Layla showcases telekinetic abilities along with the purple elevator we've seen in so many videos. She also appears to throw up a shield in the shape of a purple umbrella to protect herself and allies. At her side is her ex-boyfriend turned best friend turned vampire Jason. Layla works with him to dispatch the undead as he seems to not care much for his own kind.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/mT4ztvJkP6U\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<p>Throughout the month of April IGN will be posting these videos showcasing different heroes from Redfall, giving us a little taste of what we can expect in the game. Redfall is slated to release May 2nd.</p>",
      "article_url": "https://www.mmobomb.com/news/character-backstory-ability-reveal-layla-redfall"
    },
    {
      "id": 134113,
      "title": "Hop Into Easter With Trove's \"Bunfest 2023\" Easter Event",
      "short_description": "Beware the uprising of the eggs.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/trove-bunfest-2023-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/trove-bunfest-2023.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/trove-bunfest-2023-812x456.jpg\" alt=\"Trove Bunfest 2023\" width=\"812\" height=\"456\" /></p>\r\n<p>Beginning today and running through April 17th, <a href=\"https://www.mmobomb.com/review/trove\" target=\"_blank\" rel=\"noopener\">Trove</a> will be hosting its Bunfest 2023 Easter event with quests, activities, prizes, and a hopping good time.</p>\r\n<p>Egg enemies have invaded the lands and Buntopia Delves in order to exact revenge for Bunfests past. Complete an eight-step questline featuring new egg enemies and bosses which drop egg-themed weapon styles.</p>\r\n<p>Also new to the <a href=\"https://www.mmobomb.com/games\" target=\"_blank\" rel=\"noopener\">MMO</a>'s event is the Egghunt Dungeon where eggs have a chance to drop the Little Bit o' Eggland mount and Egg-arion Solarion Costume.</p>\r\n<p>Along with all the previous bosses in the Buntopia Delve, Tyr-egg-asaurus and King Egon will be dropping new face and helm styles, as well as a new ally.</p>\r\n<p>Easter Eggs will be appearing all over Trove once again, including Golden Eggs, and players can earn Bunfest Tokens from completing daily events and use them to craft collectibles at the Bunfest Station.</p>\r\n<p>Trove is free-to-play and actually quite a fun distraction if your current MMO is running a little low on content at the moment.</p>",
      "article_url": "https://www.mmobomb.com/news/trove-announces-bunfest-2023-easter-event"
    },
    {
      "id": 134110,
      "title": "New World Fellowship & Fire Is (Finally) Live Today",
      "short_description": "Players have been waiting... and waiting.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/new-world-fellowship-fire-launch-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/new-world-fellowship-fire-launch.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/new-world-fellowship-fire-launch-812x456.jpg\" alt=\"New World Fellowship &amp; Fire Launch\" width=\"812\" height=\"456\" /></p>\r\n<p>Following some technical issues and a <a href=\"https://www.mmobomb.com/news/new-world-first-season-fellowship-fire-delayed-once-again\" target=\"_blank\" rel=\"noopener\">few delays</a>, Fellowship &amp; Fire is finally live in <a href=\"https://www.mmobomb.com/topic/new-world\" target=\"_blank\" rel=\"noopener\">New World</a>. Game Director Scot Lane addressed the delays at the beginning of the latest episode of Forged in Aeternum. Apparently there were some issues with not receiving earned rewards that caused the delays. You can watch the first few minutes of the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a>'s latest \"Forged in Aeternum\" video to see the explanation.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/DEVwMdxyD7E\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<p>While that issue was addressed, some players are logging into live servers today to find their <a href=\"https://forums.newworld.com/t/all-my-gear-is-gone/832796/27\" target=\"_blank\" rel=\"noopener\">gear missing</a>. Luckily I logged in to a fully clothed character. Some folks are logging in to an episode of \"Naked and Afraid\".</p>\r\n<p>The main feature of Fellowship &amp; Fire is of course the new Season Pass with both a free and premium track. Players can earn Season XP by completing seasonal activities, leveling them up in the season pass and earning rewards.</p>\r\n<p>Fellowship &amp; Fire also brings a new Expedition to New World, with the new Empyrean Forge located in Great Cleave. Players will pursue the commanders of Sir Loth to stop the flow of mysterious magic deep within a necropolis.</p>\r\n<p>A nice quality-of-life upgrade is the new Gear Set storage, allowing players to save and quickly switch to different loadouts. This should be a huge improvement when running multiple dungeons.</p>\r\n<p>You can read the full blog post <a href=\"https://www.newworld.com/en-us/news/articles/season-one-fellowship-and-fire\" target=\"_blank\" rel=\"noopener\">on the site</a> and check out the launch trailer below.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/87L2TG-95s4\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/new-world-fellowship-fire-finally-live-today"
    },
    {
      "id": 134111,
      "title": "Get Ready For The Hanumatan Level 6 Guardian Raid In Lost Ark",
      "short_description": "The April update will arrive shortly.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/lost-ark-april-update-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/lost-ark-april-update.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/lost-ark-april-update-812x456.jpg\" alt=\"Lost Ark April Update\" width=\"812\" height=\"456\" /></p>\r\n<p>On April 12, Amazon and Smilegate will be dropping the next update for <a title=\"Lost Ark\" href=\"https://www.mmobomb.com/review/lost-ark\">Lost Ark</a>. This new update to the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> introduces the Level 6 Guardian Raid as well as the Brelshaza Hard Mode to the game. Of course with new content comes new gear, and players can look forward to Ancient gear.</p>\r\n<p>After a 500-year sleep, the <a title=\"Lost Ark April Update\" href=\"https://www.playlostark.com/en-us/news/articles/april-2023-date-announce\" target=\"_blank\" rel=\"noopener\">Solar Guardian Hanumatan</a> has awoken. Sensing chaos in Arkesia, the guardian has been observing things and has concluded that humanity is a problem that must be dealt with. Players will have to stop Hanumatan before he destroys humanity. To take part in the raid, players will need an item level of 1540. Defeating the guardian will earn players Ancient accessories.</p>\r\n<p>As for Brelshaza Hard Mode, that will require players to have an item level of 1540 to 1560, depending on which gate they’re attempting. The Ancient gear acquired from the new guardian raid will be of help here. Those wanting to know how best to take part in the new hard mode will want to hit up the latest <a title=\"Lost Ark Academy\" href=\"https://www.playlostark.com/en-us/news/articles/leveling-up-for-brelshaza-hard-mode\" target=\"_blank\" rel=\"noopener\">Lost Ark Academy</a>.</p>",
      "article_url": "https://www.mmobomb.com/news/get-ready-hanumatan-level-6-guardian-raid-lost-ark"
    },
    {
      "id": 134109,
      "title": "Enter Neverwinter’s Menzoberranzan Photo Contest And Earn Some Prizes",
      "short_description": "Do your best to fool a beholder with funny pictures.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/neverwinter-photo-contest-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/neverwinter-photo-contest.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/neverwinter-photo-contest-812x456.jpg\" alt=\"Neverwinter Photo Contest\" width=\"812\" height=\"456\" /></p>\r\n<p>Not everything about a city on the brink of civil war has to be serious. Sometimes things just require a little levity. With that in mind, Cryptic and Gearbox Industries are hosting the Menzoberranzan Photo Contest, offering <a title=\"Neverwinter Game Page\" href=\"https://www.mmobomb.com/review/neverwinter\">Neverwinter</a> players a chance to win some prizes by creating silly images of the Underdark in the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a>.</p>\r\n<p>Players don’t even have to take screenshots. Instead, the devs are providing them with a set of images to use. The PNG files can be downloaded from the Neverwinter site and from there it’s up to players to figure out what to do with them. There are even a few <a title=\"Neverwinter Photo Contest\" href=\"https://www.playneverwinter.com/en/news-details/11540653\" target=\"_blank\" rel=\"noopener\">images on the game’s site</a> to offer players inspiration.</p>\r\n<p>Once a player has something to enter, they’ll have to email it to the devs. The address for that can be found on the same page along with the rules for participation.</p>\r\n<p>As for the rewards, all participants will get a Rainbow Beholder Vanity Pet. Mounts and vanity pets will also be given out to a randomly drawn group of winners. Finally, a Community Reward Bundle along with 3,000 Zen will be given to the best entries – as determined by a carefully selected jury.</p>",
      "article_url": "https://www.mmobomb.com/news/enter-neverwinter-menzoberranzan-photo-contest-earn-some-prizes"
    },
    {
      "id": 134107,
      "title": "Players Spent Over $100 Million On CS:GO Cases Last Month, A New Record",
      "short_description": "About 39.5 million loot boxes were opened throughout March 2023, right after Valve announced Counter-Strike 2.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/csgo-case-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/csgo-case.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/csgo-case-812x456.jpg\" alt=\"csgo case\" width=\"812\" height=\"456\" /></p>\r\n<p>It goes without saying that gamers love gambling, especially those who play <a href=\"https://www.mmobomb.com/review/counter-strike-global-offensive\">Counter-Strike: Global Offensive</a>. </p>\r\n<p>Well last month, they REALLY loved it. So much so that players collectively spent over $100 million on cases (the game’s loot boxes), according to the website CS:GO Case Tracker. That equates to about 39.5 million cases throughout March 2023, right after <a href=\"https://www.mmobomb.com/topic/counter-strike-2\">Counter-Strike 2</a> was announced by developer Valve.</p>\r\n<p>Besides CS:GO smashing the previous record for the amount of concurrent players online, the community also broke the former record for the amount of cases — which only contain cosmetics — in a month. The number beforehand was 27.7 million cases. Each case costs between $0.70 to more than $60 to obtain and $2.50 to open.</p>\r\n<p>Valve must be ecstatic right now... and a bit richer.</p>",
      "article_url": "https://www.mmobomb.com/news/players-spent-over-100-million-cs-go-cases-last-month-new-record"
    },
    {
      "id": 134108,
      "title": "Activision, U.S. Justice Department Reach Settlement Over Salary Limits Lawsuit",
      "short_description": "Independently owned teams from Overwatch and Call of Duty imposed a tax on esports players, according to the case.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/activision-hq-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/activision-hq.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/activision-hq-812x456.jpg\" alt=\"activision hq\" width=\"812\" height=\"456\" /></p>\r\n<p>Yesterday, Activision settled with the U.S. Justice Department in regards to a lawsuit filed over salary limits in professional esports leagues.</p>\r\n<p>According to the case, independently owned teams from <a href=\"https://www.mmobomb.com/topic/overwatch\">Overwatch</a> and <a href=\"https://www.mmobomb.com/topic/call-of-duty\">Call of Duty</a> imposed a tax that \"effectively operated as a salary cap, penalized teams for paying esports players above a certain threshold and limited player compensation in these leagues.\" A complaint was filed in October 2021 over the company dropping plans for salary limits. </p>\r\n<p>\"The tax was never levied, and the leagues voluntarily dropped it from our rules in 2021,” stated Activision. “We have always believed, and still believe, that the Competitive Balance Tax was lawful, and it did not have an adverse impact on player salaries.\"</p>\r\n<p>If the settlement is approved by a federal judge, the company must not cap or limit salaries on esports players going forward.</p>\r\n<p><em style=\"box-sizing: border-box; color: #3e3f3a; font-family: Roboto, sans-serif; font-size: 16px; text-align: justify; background-color: #ffffff;\"><span style=\"box-sizing: border-box; font-weight: bolder;\">Note:</span> Activision Blizzard has had <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/activision-blizzard-sued-state-california-harassment-claims\" target=\"_blank\" rel=\"noopener\">charges filed against them by the state of California for serious harassment allegations</a>. CEO Bobby Kotick <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/wsj-investigation-alleges-that-kotick-knew-about-hid-sexual-harassment-activision-blizzard-years\" target=\"_blank\" rel=\"noopener\">is alleged to have known</a> about such actions within his company – and had separate allegations made against him in 2006 and 2007 – and in many employees' eyes failed to take adequate action. These allegations have all been denied by Activision Blizzard and the company points to additional diversity and inclusion training as past examples of taking the accusations seriously at the time they were made.</em></p>",
      "article_url": "https://www.mmobomb.com/news/activision-u-justice-department-reach-settlement-over-salary-limits-lawsuit"
    },
    {
      "id": 134106,
      "title": "Solos-Only \"Royal Rumble\" (Or \"Rumble Royale\") Mode Rumored To Be Coming To Apex Legends",
      "short_description": "If the leak is true, players will be all by themselves without abilities or pre-set loadouts.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/apex-legends-season-17-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/apex-legends-season-17.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/apex-legends-season-17-812x456.jpg\" alt=\"apex legends season 17\" width=\"812\" height=\"456\" /></p>\r\n<p>A solos-only mode is rumored to be coming to <a href=\"https://www.mmobomb.com/review/apex-legends\">Apex Legends</a> according to a leaker and data miner.</p>\r\n<p>ThordanSmash said on Twitter that a Limited-Time Mode called Rumble Royale or Royal Rumble is on the way. The gameplay will feature a randomized map where the player won’t be able to use abilities and must take on encounters by themself. In the past, this leaker/data miner has been accurate, but developer Respawn Entertainment has not confirmed anything of the like for the <a href=\"https://www.mmobomb.com/games/battle-royale\" target=\"_blank\" rel=\"noopener\">battle royale</a> hero shooter yet.</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"en\">Royal Rumble in Apex Legends is legit and my head is spinning on how its gonna release with no bugs.</p>\r\n— Thordan Smash (@Thordansmash) <a href=\"https://twitter.com/Thordansmash/status/1641173507659780099?ref_src=twsrc%5Etfw\">March 29, 2023</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<p>There was another leak earlier this month that said the mode won't allow pre-set loadouts and went over the consumables that will be included that effectively replace the absent abilities players usually have at their disposal. Those items are: Stim, Cloak, EMP, Berserk, and Swap. This information came from a post on Reddit.</p>\r\n<blockquote class=\"reddit-embed-bq\" style=\"height: 500px;\" data-embed-height=\"500\">      <a href=\"https://www.reddit.com/r/ApexUncovered/comments/11cpyuu/unconfirmed_s17_rumble_ltm_solos_details/\">[UNCONFIRMED] S17 \"Rumble\" LTM (Solos) details</a><br />by      <a href=\"https://www.reddit.com/user/Osvaldatore\">u/Osvaldatore</a> in      <a href=\"https://www.reddit.com/r/ApexUncovered/\">ApexUncovered</a>   </blockquote>\r\n<p>\r\n<script src=\"https://embed.reddit.com/widgets.js\"></script>\r\n</p>",
      "article_url": "https://www.mmobomb.com/news/rumored-solos-only-royal-rumble-or-rumble-royale-mode-coming-to-apex-legends"
    },
    {
      "id": 134105,
      "title": "GoFundMe To Help With Dark And Darker Legal Fees Started Then Immediately Paused By Developer",
      "short_description": "The original fundraiser was published “prematurely”.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/dark-darker-gofundme-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/dark-darker-gofundme.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/dark-darker-gofundme-812x456.jpg\" alt=\"Dark And Darker GoFundMe\" width=\"812\" height=\"456\" /></p>\r\n<p>Last week, <a href=\"https://www.mmobomb.com/topic/dark-darker\" target=\"_blank\" rel=\"noopener\">Dark and Darker</a> developer Ironmace found themselves <a href=\"https://www.mmobomb.com/news/darker-darker-delisted-from-steam-following-nexon-legal-action\" target=\"_blank\" rel=\"noopener\">dealing with a different kind</a> of issue related to their legal woes in the ongoing fight with Nexon over allegedly stolen assets in the game Dark and Darker. In an apparent bid to help the company pay for the legal battle – one which Nexon will have no issues paying for on their end – an employee at Ironmace decided to publish a GoFundMe, asking gamers to help reach a goal of $500,000.</p>\r\n<p>The individual also posted a letter – later deleted but <a title=\"PC Gamers Dark And Darker Go Fund Me\" href=\"https://www.pcgamer.com/dark-and-darker-dev-starts-and-then-pauses-gofundme-for-nexon-legal-battle-the-reality-of-the-situation-is-that-their-end-goal-is-to-bleed-us-dry-in-court-fees/\" target=\"_blank\" rel=\"noopener\">screen-capped by PCGamer</a> – on the Ironmace forums discussing the ongoing legal battles and discussing how Nexon’s “end goal is to bleed [them] dry in court fees”. The post then links to GoFundMe.</p>\r\n<p>According to PCGamer, there was confusion at first as to whether any of this was the work of an Ironmace employee. It’s understandable as there are currently two other GoFundMe’s for the Dark and Darker game listed – one to help pay for server tests and another to help pay the devs. These were listed months ago and asking for a much smaller amounts, but as of now haven’t received any funds.</p>\r\n<p>The company pulled the GoFundMe for helping with legal fees and closed portions of their servers until things were sorted out. A moderator also told fans to not donate to the GoFundMe at the time as they weren’t sure what was going on.</p>\r\n<p>As it turns out, the letter was legitimate – but “premature”. Despite that, the campaign did manage to raise $46,000 in less than an hour before it was removed. As mentioned, as of this writing, the fundraiser is no longer active on the GoFundMe site. What will be done with it has yet to be determined, as the company says that they’ve “paused the campaign for now” and that they will make an announcement when they’ve decided what to do.</p>",
      "article_url": "https://www.mmobomb.com/news/gofundme-to-help-dark-darker-legal-fees-paused-by-developer"
    },
    {
      "id": 134104,
      "title": "World Of Warcraft Release Dates For New Zone, Cross-Faction Guilds, And New Raid",
      "short_description": "There's a lot of content coming to Dragonflight.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/wow-aberrus-218x150.png",
      "main_image": "https://www.mmobomb.com/file/2023/4/wow-aberrus.png",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/wow-aberrus-812x456.png\" alt=\"WoW Aberrus\" width=\"812\" height=\"456\" /></p>\r\n<p>Next month will be a busy one for <a href=\"https://www.mmobomb.com/topic/world-of-warcraft\" target=\"_blank\" rel=\"noopener\">World of Warcraft</a> players as the <a href=\"https://worldofwarcraft.blizzard.com/en-us/news/23934869/this-week-in-wow-april-3-2023\" target=\"_blank\" rel=\"noopener\">first major content update</a> to the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a>'s Dragonflight expansion begins rolling out. A new zone is coming along with cross-faction guilds, new open-world content, a new raid, and more.</p>\r\n<p>On May 2nd players will begin venturing into the new zone of Zaralek Caverns. There players will meet new allies to grind rep with the molefolk known as the Niffen. Along with this patch release comes cross-faction guilds and open-world fights known as Fyrrak Assaults.</p>\r\n<p>May 9th marks the arrival of Dragonflight Season 2, bringing with it the ability to breach Neltharion's secret laboratory, <a href=\"https://www.mmobomb.com/news/world-of-warcraft-looks-ahead-to-embers-of-neltharion-update\" target=\"_blank\" rel=\"noopener\">Aberrus</a>, in Normal, Heroic, and Mythic difficulties. The new season also brings a new PvP ladder and gear. New dungeons in the Mythic+ rotation will be Brackhide Hollow, Halls of Infusion, Uldaman, Legacy of Tyr, Neltharus, Freehold, Underrot, Vortex Pinnacle, and Neltharion's Lair.</p>\r\n<p>April 2-8 is the also the return of The Darkmoon Faire. April 4th brings Mists of Pandaria Timewalking, Arena Skirmish bonus event, PvP Brawl Shado-Pan Showdown, and WoW Spring Deals. April 5th is the \"March of the Tadpoles\" Micro-Holiday.</p>\r\n<p>That's a ton of things coming to World of Warcraft over the next month.</p>\r\n<p><em style=\"box-sizing: border-box; color: #3e3f3a; font-family: Roboto, sans-serif; font-size: 16px; text-align: justify; background-color: #ffffff;\"><span style=\"box-sizing: border-box; font-weight: bolder;\">Note:</span> Activision Blizzard has had <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/activision-blizzard-sued-state-california-harassment-claims\" target=\"_blank\" rel=\"noopener\">charges filed against them by the state of California for serious harassment allegations</a>. CEO Bobby Kotick <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/wsj-investigation-alleges-that-kotick-knew-about-hid-sexual-harassment-activision-blizzard-years\" target=\"_blank\" rel=\"noopener\">is alleged to have known</a> about such actions within his company – and had separate allegations made against him in 2006 and 2007 – and in many employees' eyes failed to take adequate action. These allegations have all been denied by Activision Blizzard and the company points to additional diversity and inclusion training as past examples of taking the accusations seriously at the time they were made.</em></p>",
      "article_url": "https://www.mmobomb.com/news/world-of-warcraft-release-dates-new-zone-cross-faction-guilds-new-raid"
    },
    {
      "id": 134103,
      "title": "Final Fantasy XIV’s 6.38 Patch Updates Battle System And Makes Several Class Adjustments In PvP",
      "short_description": "Several Eureka Orthos issues have been fixed as well.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/final-fantasy-xiv-6-38-update-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/final-fantasy-xiv-6-38-update.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/final-fantasy-xiv-6-38-update-812x456.jpg\" alt=\"Final Fantasy XIV 6-38 Update\" width=\"812\" height=\"456\" /></p>\r\n<p>Today, North American <a title=\"Final Fantasy XIV Topic\" href=\"https://www.mmobomb.com/topic/final-fantasy-xiv\">Final Fantasy XIV</a> players are busy doing other things while they wait for the game’s servers to come back up. To implement new Data Centers for the region, Square Enix brought the servers down for a 24-hour period, coinciding with the release of the <a title=\"Patch. 6.38 Final Fantasy XIV\" href=\"https://na.finalfantasyxiv.com/lodestone/topics/detail/99372e256a66b3103f633b1951efb38c9a050aab\" target=\"_blank\" rel=\"noopener\">Patch 6.38 update</a>.</p>\r\n<p>Today’s update isn’t huge, but it does make a few important changes for raiders and PvPers. First off, the restrictions have been lifted on the Pandaemonium: Abyssos Savage raids, so if you’re still trying to get that gear, you’ll have a better chance of doing it now. The entrance restriction has been lifted as well.</p>\r\n<p>Several classes have had some skills adjusted for PvP. It’s a mix of nerfs and buffs, so whether or not these are good things are going to depend on what classes you play and which you think are the biggest pain in the ass to deal with.</p>\r\n<p>Speaking of PvP, Season 5 of Crystalline Conflict has come to an end, and Six begins when the patch is finished. Players will be able to pick up their Season 5 rewards and must do so before the end of Season 6.</p>\r\n<p>Finally, the update includes a selection of fixes, several of which are for Eureka Orthos. If you’ve been having problems there, that may help. Also, any male Lalas who have found the Valentione Rose Heels weren’t displaying quite right for them will be happy to know that’s been addressed.</p>",
      "article_url": "https://www.mmobomb.com/news/final-fantasy-xiv-6-38-patch-updates-battle-system-makes-several-class-adjustments-pvp"
    },
    {
      "id": 134102,
      "title": "Hearthstone 26.0 Patch Notes Details New Expansion, New Signature Cards, And More For Tomorrow's Launch",
      "short_description": "Patch 26.0 paves the way for the Festival of Legends expansion.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/hearthstone-festival-of-legends-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/hearthstone-festival-of-legends.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/hearthstone-festival-of-legends-812x456.jpg\" alt=\"Hearthstone Festival of Legends\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.mmobomb.com/review/hearthstone-heroes-warcraft\" target=\"_blank\" rel=\"noopener\">Hearthstone's</a> patch 26.0 launches tomorrow, April 4th, bringing with it card balance updates, the end of the current Duels seasons, and plenty of bug fixes. But perhaps more importantly is that it sets the stage for the April 11th release of the Festival of Legends expansion.</p>\r\n<p>Festival of Legends will bring 145 new cards and features the \"Finale\" keyword. You can check out all the new cards coming with Festival of Legends in the Hearthstone <a href=\"https://hearthstone.blizzard.com/en-us/cards?set=festival-of-legends\" target=\"_blank\" rel=\"noopener\">card library</a>.</p>\r\n<p>Along with the launch of Festival of Legends comes the new Standard rotation. Rotating out of Standard will be Forged in the Barrens, United in Stormwind, and Fractured in Alterac Valley. Rotating into Standard will be Voyage to the Sunken City, Murder at Castle Narthria, March of the Lich King, Path of Arthas, Festival of Legends, and the free Core set.</p>\r\n<p>From April 18th through May 2nd players can take part in the Legends Take The Stage special event. Complete Event Quests to earn Event XP on a special Event Track.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/hearthstone-legends-take-stage-event-track-812x456.jpg\" alt=\"Hearthstone Legends Take The Stage Event Track\" width=\"812\" height=\"456\" /></p>\r\n<p>Finally, Signature Cards are getting a revamp for Hearthstone's Festival of Legends. They will now focus more on the art of the card with thinner borders and card text now being moved to the tooltip.</p>\r\n<p>You can check out the full breakdown with all the <a href=\"https://www.mmobomb.com/games/card\" target=\"_blank\" rel=\"noopener\">card game</a>'s changes for Patch 26.0 on the official <a href=\"https://hearthstone.blizzard.com/en-us/news/23934449/26-0-patch-notes\" target=\"_blank\" rel=\"noopener\">Hearthstone blog post</a>.</p>\r\n<p><em style=\"box-sizing: border-box; color: #3e3f3a; font-family: Roboto, sans-serif; font-size: 16px; text-align: justify; background-color: #ffffff;\"><span style=\"box-sizing: border-box; font-weight: bolder;\">Note:</span> Activision Blizzard has had <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/activision-blizzard-sued-state-california-harassment-claims\" target=\"_blank\" rel=\"noopener\">charges filed against them by the state of California for serious harassment allegations</a>. CEO Bobby Kotick <a style=\"box-sizing: border-box; color: #fd3a0d; cursor: pointer;\" href=\"https://www.mmobomb.com/news/wsj-investigation-alleges-that-kotick-knew-about-hid-sexual-harassment-activision-blizzard-years\" target=\"_blank\" rel=\"noopener\">is alleged to have known</a> about such actions within his company – and had separate allegations made against him in 2006 and 2007 – and in many employees' eyes failed to take adequate action. These allegations have all been denied by Activision Blizzard and the company points to additional diversity and inclusion training as past examples of taking the accusations seriously at the time they were made.</em></p>",
      "article_url": "https://www.mmobomb.com/news/hearthstone-26-0-patch-notes-details-new-expansion-new-signature-cards-more"
    },
    {
      "id": 134101,
      "title": "National Labor Relations Board Pursues Complaints Filed Against Activision Blizzard By The CWA",
      "short_description": "The NLRB found merit in charges of illegal surveillance and threats to remove internal channels.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/activision-blizzard-nrlb-complaint-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/activision-blizzard-nrlb-complaint.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/activision-blizzard-nrlb-complaint-812x456.jpg\" alt=\"Activision Blizzard NRLB Complaint\" width=\"812\" height=\"456\" /></p>\r\n<p>Another day, another problem to add to <a title=\"Activision Blizzard Topic\" href=\"https://www.mmobomb.com/topic/activision-blizzard\">Activision Blizzard</a>’s very long list of problems. We’re sure they’re used to it by now. In this case, the National Labor Relations Board has agreed to go forward with a complaint made against the company by the Communications Workers of America union. Previously, the union made three charges against Activision Blizzard. <a title=\"NLRB Complaint Activision Blizzard GamesIndustry.biz\" href=\"https://www.gamesindustry.biz/nlrb-finds-merit-in-unions-case-against-activision-blizzard\" target=\"_blank\" rel=\"noopener\">The NLRB decided to move forward with two</a> of them.</p>\r\n<p>The first complaint accuses the company of using illegal surveillance during the July 2022 walkout in protest of the Supreme Court decision overturning Roe v. Wade. The second was Activision Blizzard threatening to block employees from internal channels where they talked about work-related things, like wages and working conditions.</p>\r\n<p>The third charge, which was dropped, claimed that ABK cut off access to chat during an all-hands meeting. Blizzard claimed that the chat function was removed because certain employees were using it to malign other employees, particularly the Diablo Immortal team.</p>",
      "article_url": "https://www.mmobomb.com/news/national-labor-relations-board-pursues-complaints-filed-against-activision-blizzard-by-cwa"
    },
    {
      "id": 134100,
      "title": "The Next Perfect World Themed Game, \"Perfect New World\", Now Has A Steam Page",
      "short_description": "This is no April Fools prank, Perfect New World is officially listed on Steam.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/perfect-new-world-ironmace-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/perfect-new-world-ironmace.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/perfect-new-world-ironmace-812x456.jpg\" alt=\"Perfect New World Ironmace\" width=\"812\" height=\"456\" /></p>\r\n<p>The title sounds like a late April Fools' joke, but Perfect New World is not some funny mashup of Perfect World and New World, it is its own game with a <a href=\"https://store.steampowered.com/app/2359600/Perfect_New_World/\" target=\"_blank\" rel=\"noopener\">Steam page</a>, a new trailer, and everything.</p>\r\n<p>Billed as an Eastern Fantasy <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> developed and published by Ironcore Game Studios, players in Perfect New World will become a Soul Tamer and search for the reincarnated Prime. The Steam page mentions both PvE and PvP play, as well as a large open world with no loading screens.</p>\r\n<p>The game was previously revealed a few years back and, if plans from that time are still accurate, should come to PC, mobile, and consoles.</p>\r\n<p>\"You and your friends venture into the vast continent of Perfect World in search of mystical eastern powers. Mysteries of all kinds await your discovery. Boosters will unlock new perspectives to help you better explore this unknown world.\"</p>\r\n<p>Featured on the Steam page are three races; Elvens, Mythics, and Humans. Three classes are are also mentioned as Berserker, Galeblade, and Mysticsword.</p>\r\n<p>The release date is simply listed as \"Coming Soon\". You can check out the full trailer for Perfect New World below.</p>\r\n<p>If you have questions, like we do, you're probably going to have to wait a bit. The game does have an <a href=\"https://discord.com/invite/3q5Ueb7Z4c\" target=\"_blank\" rel=\"noopener\">official Discord</a> you can join now, but it's clear it is VERY new and doesn't have anything posted in the FAQ channel as of this writing.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/mwe4GQ-qpJY\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/the-next-perfect-world-game-perfect-new-world-now-steam-page"
    },
    {
      "id": 134099,
      "title": "Naraka: Bladepoint Goes Sci-Fi, Grab The New \"Saber\" With A Lot Of \"Light\" Quickly Though",
      "short_description": "Trade your longswords for… we’re not calling it a light saber.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/naraka-blade-point-april-fools-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/naraka-blade-point-april-fools.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/naraka-blade-point-april-fools-812x456.jpg\" alt=\"Naraka Blade Point April Fools\" width=\"812\" height=\"456\" /></p>\r\n<p><a title=\"Naraka: Bladepoint Game Page\" href=\"https://www.mmobomb.com/topic/naraka-bladepoint\">Naraka: Bladepoint</a> is getting in on the April Fools' fun this year by adding a little sci-fi to the game. For a limited time, players will be able to earn a special longsword skin inspired by “a certain sci-fi icon” – one that will swap the sounds of the metal blade for something more electric and zappy.</p>\r\n<p>As mentioned, the event is limited time – very limited. It ends tomorrow April 4, so players wanting to get the skin will need to log in today to attempt to get it. The item isn’t guaranteed after completing a specific quest. Instead, players will have to open chests and crush items during gameplay to get it to drop.</p>\r\n<p>There are other April Fools’ items that will drop as well. These include things like quirky outfits and canine headwear, so even if players don’t uncover the sword skin, they’ll still get something for their effort.</p>",
      "article_url": "https://www.mmobomb.com/news/naraka-bladepoint-goes-sci-fi"
    },
    {
      "id": 134098,
      "title": "UPDATED: New World’s First Season, Fellowship And Fire, Delayed Once Again",
      "short_description": "The ending time for the Leaderboards was also extended.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/new-world-fellowship-fire-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/new-world-fellowship-fire.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/new-world-fellowship-fire-812x456.jpg\" alt=\"new world fellowship and fire\" width=\"812\" height=\"456\" /></p>\r\n<p>Another day, another delay for <a href=\"https://www.mmobomb.com/topic/new-world\">New World’s</a> very first season.</p>\r\n<p>Fellowship &amp; Fire was supposed to launch last week, but Amazon Games <a href=\"https://www.mmobomb.com/news/new-world-delays-season-1-fellowship-fire\" target=\"_blank\" rel=\"noopener\">pushed the update back</a> due to technical difficulties. Aside from that, the developers also announced an extension to the Leaderboard's end time so it coincides with the release of the new season in the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a>.</p>\r\n<p>First, it was March 30, then March 31, next, April 2, and now finally, April 4. (Unless the team behind New World decides Fire &amp; Fellowship is still not ready.)</p>\r\n<p>The community is not happy, of course. Aside from naturally itching for more content, there’s been somewhat of a drought for New World in that department. Also, Amazon Games has not really said what the problem is specifically that’s causing these delays.</p>\r\n<p>UPDATE: Tomorrow's release <a href=\"https://forums.newworld.com/t/downtime-fellowship-and-fire-april-4th-2023/832648\" target=\"_blank\" rel=\"noopener\">seems to be confirmed</a> for the moment.</p>",
      "article_url": "https://www.mmobomb.com/news/new-world-first-season-fellowship-fire-delayed-once-again"
    },
    {
      "id": 134096,
      "title": "Jagex Announces New RuneScape Content: “Fort Forinthry: Unwelcome Guests\" ",
      "short_description": "The season carries on with a new mini-quest and Slayer Challenge, plus an evil necromancer.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/runescape-unwelcome-guests-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/runescape-unwelcome-guests.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/runescape-unwelcome-guests-812x456.jpg\" alt=\"runescape unwelcome guests\" width=\"812\" height=\"456\" /></p>\r\n<p>Citizens of Gielinor are welcomed to <a href=\"https://www.mmobomb.com/review/runescape\">RuneScape’s</a> “Fort Forinthry: Unwelcome Guests.” The Fort Forinthry Season carries on with a new mini-quest and Slayer Challenge.</p>\r\n<p>Players will team up with an original Slayer Master who goes by \"The Raptor\" to defeat the mysterious horde of the undead and find out where these zombies came from. Also, an evil necromancer enters the scene: Zemouregal.</p>\r\n<p>Four unique slayer creatures are being added: Fetid Zombie, Bound Skeleton, Risen Ghost, and Armored Phantom. Players that conquer these creatures will earn Slayer Trophies that boost rewards and buffs as well as a rare drop — the new two-handed magic ability.</p>\r\n<p>Last but not least, as per usual, the Guardhouse must continue being built in order to increase the effect of the Slayer skill, which includes additional damage bonuses and higher spawn rates for Elite monsters.</p>\r\n<p>Members of RuneScape can check this exciting content out when it launches in the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> on April 10.</p>",
      "article_url": "https://www.mmobomb.com/news/jagex-announces-new-runescape-content-fort-forinthry-unwelcome-guests"
    },
    {
      "id": 134097,
      "title": "Ashes of Creation Developers Show Off New Dungeon: The Tower of Carphin",
      "short_description": "This ruined university is \"a dungeon with an open world,” according to Intrepid Studios. ",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/ashes-of-creation-tower-of-carphin-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/ashes-of-creation-tower-of-carphin.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/4/ashes-of-creation-tower-of-carphin-812x456.jpg\" alt=\"ashes of creation tower of carphin\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.mmobomb.com/topic/ashes-of-creation\" target=\"_blank\" rel=\"noopener\">Ashes of Creation</a> is still not out yet, not even close, but Intrepid Studios just dropped another lengthy video revealing exclusive gameplay that takes place in a never-before-seen dungeon that the developers teased in the past.</p>\r\n<p>“The wreckage of Carphin, towering over the Riverlands, plays an important part in the history of Verra.” These ruins are called the Tower of Carphin, a university ”that’s filled with ancient arcane treasures, unknown horrors, and powerful foes.” What’s interesting about this place though is that it’s “a dungeon with an open world,” according to Intrepid Studios. </p>\r\n<p>Besides that, the team behind the upcoming sandbox <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> also showed off the Story Arc System. Quest givers are spawned that alter certain areas of the world, filling them with special monsters and resources. Players are able to not just complete these missions but influence how the story is told.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/nOd9PV6jcqU\" title=\"Development Update with Story Arc Systems and the Lore of Carphin - 11AM PT Friday, March 31, 2023\" width=\"885\" height=\"498\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/ashes-of-creation-developers-show-off-new-dungeon-tower-of-carphin"
    },
    {
      "id": 134081,
      "title": "Top 8 MMORPGs That Are Not Pay-To-Win (2023)",
      "short_description": "There's no competitive advantage in the cash shop for these games.",
      "thumbnail": "https://www.mmobomb.com/file/2023/4/final-fantasy-14-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/4/final-fantasy-14.jpg",
      "article_content": "<p><img src='https://www.mmobomb.com/file/2023/4/final-fantasy-14-812x456.jpg' class='type:primaryImage aligncenter size-large' alt='Final Fantasy 14' width='812' height='456'/></p>\r\n<p>Pay-to-win can mean a lot of different things to different folks these days. Some say any sort of XP boost is pay-to-win, while others look for competitive advantage. In this week's list, we'll be looking at games that do not offer any sort of competitive advantage via cash shops. We're also avoiding games where you can exchange real money for in-game currency (Guild Wars 2 and Star Wars: The Old Republic as examples).</p>\r\n<p>Here are 8 <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG Games</a> we believe are NOT pay-to-win.</p>\r\n<h2>World of Warcraft</h2>\r\n<p>With its box price and sub fee, <a href=\"https://www.mmobomb.com/topic/world-of-warcraft\" target=\"_blank\" rel=\"noopener\">World of Warcraft</a> is one of the biggest MMOs out there. Although the game does feature a cash shop, there's nothing pay-to-win about it. You can purchase the usual stuff like mounts, character transfers, etc., but there's no character power to be had in the cash shop for WoW, unless you're a total purist that counts character level boosts.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/3ZtedjN1JXY\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<h2>Final Fantasy XIV</h2>\r\n<p>Speaking of the biggest MMORPG's, <a href=\"https://www.mmobomb.com/topic/final-fantasy-xiv\" target=\"_blank\" rel=\"noopener\">Final Fantasy XIV</a> does have a cash shop on top of its free-to-try then buy the box and pay a sub model, you have to go outside of the game to spend any additional money. Even then there's no power to be found outside of the typical cash shop offerings of cosmetics and the like. </p>\r\n<p><iframe src=\"https://www.youtube.com/embed/Jt1h1MinlLI\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<h2>Elder Scrolls Online</h2>\r\n<p>Out of all the games on this list, <a href=\"https://www.mmobomb.com/topic/the-elder-scrolls-online\" target=\"_blank\" rel=\"noopener\">The Elder Scrolls Online</a> probably pushes you hardest into the cash shop, but you won't be buying anything there that can give you a competitive advantage over other players. There are XP boosts, cosmetics, mounts, and good ol' loot boxes, but you can't get anything that's going to make you more powerful than other players. Even Vampire and Werewolf bites can be gotten for free in-game just by asking in chat, so don't waste your money on those.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/sbXQadoQmYw\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<h2>Runescape</h2>\r\n<p><a href=\"https://www.mmobomb.com/review/runescape\" target=\"_blank\" rel=\"noopener\">Runescape</a> and Old School Runescape continue to be beacons of light in the free-to-play landscape, offering fair cash shops with no competitive advantages. Old School Runescape in particular seems to be one of the few MMORPGs out there that gets better with age.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/mXAvlbgd_-c\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<h2>New World</h2>\r\n<p><a href=\"https://www.mmobomb.com/topic/new-world\" target=\"_blank\" rel=\"noopener\">New World</a> is one of my favorite MMOs, and I'm happy to report that the cash shop contains nothing but cosmetics. Want a new outfit to wear? The cash shop has you covered. Want a powerful new weapon? You're gonna have to grind that out in the game.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/m1C5dLnvlzg\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<h2>Dungeons &amp; Dragons Online</h2>\r\n<p><a href=\"https://www.mmobomb.com/review/dungeons-dragons-online\" target=\"_blank\" rel=\"noopener\">Dungeons &amp; Dragons Online</a> has one of the more fair free-to-play models out there with the usual cash shop offerings but nothing that's going to take you to the next level of competitive advantage. It should be noted here that while not \"P2W\" necessarily, some user bemoan the required purchase of certain quest packs. Luckily <a href=\"https://www.mmobomb.com/news/standing-stone-games-offers-big-list-of-dungeons-dragon-online-quest-packs-free\" target=\"_blank\" rel=\"noopener\">some of them are free</a> right now.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/lz3HUwk5YcY\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<h2>Embers Adrift</h2>\r\n<p><a href=\"https://www.mmobomb.com/topic/embers-adrift\" target=\"_blank\" rel=\"noopener\">Embers Adrift</a> has a box price and a sub, both of which were <a href=\"https://www.mmobomb.com/news/embers-adrift-decreases-box-sub-price-starting-next-week\" target=\"_blank\" rel=\"noopener\">recently reduced</a>, but actually contains no cash shop whatsoever, making it a real outlier in the world of MMORPGs. It's really hard to find another MMO that has zero microtransactions, so if you want the purest definition of not pay-to-win then it's hard to beat not paying for anything in a cash shop at all.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/40PFavyOp1k\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<h2>Warframe</h2>\r\n<p>Sure maybe Warframe is not really an \"MMORPG\", but this game is definitely famous for its fair cash shop practices. <a href=\"https://www.mmobomb.com/review/warframe\" target=\"_blank\" rel=\"noopener\">Warframe</a> is a prime example of how to do a cash shop correctly and for that reason, we have to include it on this list. Yes, you can buy some convenience and cosmetics, but there's nothing there that is going to make you better than the guy beside you at anything you can do.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/MsbL8lFHrZI\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<p>That's our list of the top MMORPGs that are NOT pay-to-win. Did we miss any of your favorites? What is your definition of pay-to-win? Let us know in the comments section below.</p>",
      "article_url": "https://www.mmobomb.com/top-mmorpg-that-are-not-pay-to-win"
    },
    {
      "id": 134093,
      "title": "War Thunder Adding Infantry Exo Suits And Giant Soviet Robots",
      "short_description": "Infantry and Soviet Robots are coming.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/war-thunder-infantry-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/war-thunder-infantry.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/war-thunder-infantry-812x456.jpg\" alt=\"war thunder infantry\" width=\"812\" height=\"456\" /></p>\r\n<p>Get ready for a game changer in <a href=\"https://www.mmobomb.com/review/war-thunder\" target=\"_blank\" rel=\"noopener\">War Thunder</a> as the game announced today a duo of updates sure to turn things on their head for players.</p>\r\n<p>First up is the Open Beta testing for Infantry. The classic War Thunder experience, which began in the air and then added sea and land vehicles, is now adding mobile boots on the ground. Equipped with powerful exo-suits, infantry members take to the battlefield. Check out the trailer below.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/vJYOKC3KrsY\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>\r\n<p>Next up is the Atomic Thunder update which adds large Soviet robots to the <a href=\"https://www.mmobomb.com/games/strategy\" target=\"_blank\" rel=\"noopener\">military game</a>'s battlefield. Each robot will play a unique role such as the MA-9 Belyash welding robot which is heavily inspired by chimpanzees and can easily climb even on vertical surfaces, making the perfect scout. More information on testing and further robot specialties will be unveiled at a later date.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/war-thunder-atomic-thunder-812x456.jpg\" alt=\"war thunder atomic thunder\" width=\"812\" height=\"456\" /></p>\r\n<p>With this set of changes to the game it's unlikely that current metas will stand, and players will be looking for new ways to engage in the battle. It's a little odd that some of these changes are making their way into the game, seeing as how realism is apparently no longer a priority... but what are you gonna do, I mean it's not like it's April 1st or anything.</p>",
      "article_url": "https://www.mmobomb.com/news/war-thunder-adding-infantry-exo-suits-giant-soviet-robots"
    },
    {
      "id": 134095,
      "title": "Roblox Announces Policy To Hide Ads From Minors",
      "short_description": "Users 13 and under will no longer see ads of any kind.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/roblox-advertising-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/roblox-advertising.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/roblox-advertising-812x456.jpg\" alt=\"Roblox Advertising\" width=\"812\" height=\"456\" /></p>\r\n<p>A year after a complaint regarding <a title=\"Roblox\" href=\"https://www.mmobomb.com/review/roblox\">Roblox</a>’s in-game advertisement was filed with the FTC, the company has announced a big change to the policy. No, they’re not getting rid of ads in full. No one could be that lucky. However, they will quit showing ads to players 13 and under. Considering more than 25 million kids play their game, that’s a lot of lost advertising views, but we suppose it is better than having the FTC coming down on you – particularly when your game is known for attracting kids.</p>\r\n<p>According to a report on <a title=\"Gamesindustry.biz\" href=\"https://www.gamesindustry.biz/roblox-will-hide-ads-for-users-13-and-under\" target=\"_blank\" rel=\"noopener\">Gamesindustry.biz</a>, that’s not the only change being made to advertising in the game either. The new policy also blocks specific types of ads. These include soliciting donations, promoting multilevel marketing companies or their products, promoting financial services, and anything that promotes crypto and NFTs.</p>\r\n<p>The new rules, which can be found on <a title=\"Roblox Help Site Advertising\" href=\"https://en.help.roblox.com/hc/en-us/articles/13722260778260\" target=\"_blank\" rel=\"noopener\">Roblox’s help site</a>, also include guidelines for ad transparency, what can be uploaded to the ad manager, and intellectual property. It also bars advertisers from using methods to pull people away from the Roblox platform. Links and QR codes are out.</p>",
      "article_url": "https://www.mmobomb.com/news/roblox-announces-policy-to-hide-ads-from-minors"
    },
    {
      "id": 134089,
      "title": "Broken Ranks Update Will Add New Instance, Gear Overhaul, And A Winged Lady Out To Murder You",
      "short_description": "Prepare to face the Winged Lady.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/broken-ranks-april-23-update-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/broken-ranks-april-23-update.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/broken-ranks-april-23-update-812x456.jpg\" alt=\"Broken Ranks April 23 Update\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.mmobomb.com/topic/broken-ranks\" target=\"_blank\" rel=\"noopener\">Broken Ranks</a> is preparing to drop another update on April 4th, this time bringing a new instance with an introductory quest, a gear overhaul, the spring event, a new sidequest, and many fixes and improvements to the game.</p>\r\n<p>The gear overhaul will provide more ways to customize your gear by adding the ability to insert modifiers into legendary gear. You'll be able to combine these modifiers into more powerful versions, extract them, and place them in other gear pieces.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/broken-ranks-drifs-modifiers-812x456.jpg\" alt=\"Broken Ranks drifs modifiers\" width=\"812\" height=\"456\" /></p>\r\n<p>Players will be venturing into Broken Ranks' new instance Sidraga, where they will take on the Winged Lady in the game's unique turn-based combat system. A lead-in quest will be available to players at least level 135.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/broken-ranks-winged-lady-instance-812x456.jpg\" alt=\"Broken Ranks winged lady instance\" width=\"812\" height=\"456\" /></p>\r\n<p>The Bunny Marathon spring event will begin on April 8th and last for 72 hours. Players can obtain dungeon entry items, experience, utility items, and other prizes including a new skin that will be part of a new event skin set. New pieces will be added to the event every year.</p>\r\n<p>You can read up on all the updates and changes to Broken Ranks in the <a href=\"https://brokenranks.com/news/update---the-winged-lady-and-the-gear-reform\" target=\"_blank\" rel=\"noopener\">blog post.</a></p>",
      "article_url": "https://www.mmobomb.com/news/broken-ranks-update-will-add-new-instance-gear-overhaul-more"
    },
    {
      "id": 134090,
      "title": "Everquest 2 Pulls Down \"Pay-To-Raid\" Loot Boxes From Cash Shop",
      "short_description": "The community was not happy with the new personal loot system.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/everquest-2-pulls-pay-to-raid-loot-boxes-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/everquest-2-pulls-pay-to-raid-loot-boxes.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/everquest-2-pulls-pay-to-raid-loot-boxes-812x456.jpg\" alt=\"Everquest 2 pulls pay to raid loot boxes\" width=\"812\" height=\"456\" /></p>\r\n<p>Earlier this month, <a href=\"https://www.mmobomb.com/review/everquest-2\" target=\"_blank\" rel=\"noopener\">Everquest 2</a> announced a <a href=\"https://www.mmobomb.com/news/everquest-2-players-unhappy-new-pay-to-win-loot-system\" target=\"_blank\" rel=\"noopener\">new loot box system</a> that bypassed lockouts and provided the chance to buy more opportunities at raid gear through the cash shop. Needless to say, the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a>'s community was not happy about the changes and took to the forums to let the developers at Daybreak know.</p>\r\n<p>Fast-forward to yesterday when developer Kander took to the forums to let players know that they would be taking down the loot boxes in question from the cash shop, and no other personal loot system would be taking its place.</p>\r\n<p>\"After listening to your feedback and having lots of discussions, we have decided to pull the Libant Evernight Heritage Crate from the in-game Marketplace store,\" the post reads. \"The crate and most of its current contents will no longer be for sale.</p>\r\n<p>\"We heard you and understand that there were particular elements of the Libant Heritage Crate that run counter to our shared values. We will no longer be making any of these types of items available. We will, however, be putting up a different crate in the future with a format similar to previous crates.\"</p>\r\n<p>It's good to see a system like this go away, especially considering the \"pay-to-win\" nature of the system, or \"pay-to-raid\" as so many forum posters put it. What players should not forget, however, is that Daybreak wanted this type of system in place, and could try something similar in the future. Keep your eyes open Everquest 2 players, and keep fighting the good fight.</p>",
      "article_url": "https://www.mmobomb.com/news/everquest-2-pulls-down-pay-to-raid-loot-boxes-from-cash-shop"
    },
    {
      "id": 134092,
      "title": "Genshin Impact 3.6 Update Lets Players Get To Know The Head of The Bubu Pharmacy A Bit More",
      "short_description": "Baizhu brings his own special skills to the field.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/genshin-impact-6-3-special-program-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/genshin-impact-6-3-special-program.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/genshin-impact-6-3-special-program-812x456.jpg\" alt=\"Genshin Impact 6-3 Special Program\" width=\"812\" height=\"456\" /></p>\r\n<p>Today, HoYoVerse held the Special Program Stream for the <a title=\"Genshin Impact Game Page\" href=\"https://www.mmobomb.com/review/genshin-impact\">Genshin Impact's</a> Version 6.3 update. Titled \"A Parade of Providence\", the update arrives on April 12 and will add two new playable characters to the roster; everyone’s favorite Liyue doctor Baizhu and Sumeru’s famous architect Kaveh. Both are Dendro Vision wielders and both have a very unique form of combat intended to not only generate powerful attacks but also to assist the party.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/genshin-impact-baizhu-812x456.png\" alt=\"Genshin Impact Baizhu\" width=\"812\" height=\"456\" /></p>\r\n<p>The update will offer players a bit more background on Baizhu and his history with a story quest, while Kaveh will appear in the main event for 3.6. This event will focus on the Academia Extravaganza with both the Wisdom Gala and the Inter-Darshan Championship. Both feature the Darshans of the various schools in Sumeru, with the first part having mini-games thought up by the Darshans themselves. The latter sees the Darshans selecting representatives from their school to compete against each other.</p>\r\n<p>Speaking of the representatives, the representative for the Rtawahist Darshan, Layla, will be getting her own hangout quest.</p>\r\n<p>Other events will be taking place in Sumeru as well. First, players will need to help with the Wenut issue in the desert. This requires players to fight back hordes of beasts as they also use the Wenutslayer Cannon to fight back the Wenut.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/genshin-impact-new-zone-812x456.png\" alt=\"Genshin Impact New Zone\" width=\"812\" height=\"456\" /></p>\r\n<p>Speaking of the desert, players will also have a new area to explore, northwest of the Desert of Hadramaveth. This area was one of the main rifts that monsters came into Teyvat during the Khaenri’ah disaster as well as the site of a battle. The leftover power of the Abyss has changed the area’s ecological system, making it an uninhabited swamp area instead of a desert. To explore this area, players will be able to become a Pari and fly through the zone. In exchange, the Pari helping us will be recovering its power along the way.</p>\r\n<p>New bosses will be introduced as well – including Hilichurl Rogues and a new dragon, the Dragon of Verdure, Apep. This dragon once ruled Sumeru, but has since been tainted. Players will have to face off against this new dragon, but… like others… it would seem the end goal is to save it. All of this will also be a continuation of Nahida’s story.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/genshin-impact-sumeru-dragon-812x456.png\" alt=\"Genshin Impact Sumeru Dragon\" width=\"812\" height=\"456\" /></p>\r\n<p>Of course, the stream also offered players codes. As always, these are only of use today, so be sure to go to the Genshin Impact site and use them soon.</p>\r\n<p>Redemption Code 1: <strong>9ARE6VLJT34H</strong></p>\r\n<p>Redemption Code 2: <strong>KBRE7D4KA2MM</strong></p>\r\n<p>Redemption Code 3: <strong>7S9X6V4JB2M9</strong></p>\r\n<p><iframe src=\"https://www.youtube.com/embed/B3twe5LbGrQ\" title=\"YouTube video player\" width=\"709\" height=\"418\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/genshin-impact-3-6-update-lets-players-get-to-know-head-of-bubu-pharmacy-bit-more"
    },
    {
      "id": 134091,
      "title": "Lost Ark Prepares Players For Brelshaza Hard Mode, Details Requirements",
      "short_description": "Get ready to face Brelshaza Hard Mode.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/lost-ark-valtan-inferno-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/lost-ark-valtan-inferno.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/lost-ark-valtan-inferno-812x456.jpg\" alt=\"Lost Ark Valtan Inferno\" width=\"812\" height=\"456\" /></p>\r\n<p>With the April update right around the corner for <a href=\"https://www.mmobomb.com/review/lost-ark\" target=\"_blank\" rel=\"noopener\">Lost Ark</a>, the developers are preparing players for what is to come and the requirements for getting into Brelshaza Hard Mode once it goes live in the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> next month.</p>\r\n<p>For gates 1 &amp; 2 players will need Item Level 1540, for gates 3 &amp; 4 players will need Item Level 1550, and for gates 5 &amp; 6 players will need Item Level 1560.</p>\r\n<p>Brelshaza Hard mode will also be introducing new challenges and mechanics to the raid, so look for encounters to differ slightly from normal mode.</p>\r\n<p>Ark Pass Season 3 is also coming soon, bringing 30 new levels of rewards for players to earn by playing the game. Per usual there will be a free track, a Premium track, and a Super Premium track.</p>\r\n<p>Lost Ark players can complete the quest \"Berver's Friend\" from Punika anytime between now and the April update to be eligible for the Punika Powerpass. The pass allows you to bring an alternate character up to the same point in the story.</p>\r\n<p>Along with the Punika Pass comes the Hyper Express Plus event. Choose a character to participate and they will earn rewards every 15 item levels that help them advance between levels 1340 and 1445.</p>\r\n<p>You can check out the full blog post <a href=\"https://www.playlostark.com/en-us/news/articles/leveling-up-for-brelshaza-hard-mode#ags-MediaPopup\" target=\"_blank\" rel=\"noopener\">on the official site</a>, and we'll keep you updated as we draw nearer to the April update for Lost Ark.</p>",
      "article_url": "https://www.mmobomb.com/news/lost-ark-prepares-players-brelshaza-hard-mode-details-requirements"
    },
    {
      "id": 134088,
      "title": "Live Letter Recap: Final Fantasy XIV Patch 6.4 Will Bring Long-Awaited Love For The Blue Mage Crowd",
      "short_description": "Today’s Letter from the Producer Live teased updates coming in 6.4 and 6.45.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-blue-mage-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-blue-mage.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-blue-mage-812x456.jpg\" alt=\"Final Fantasy XIV Blue Mage\" width=\"812\" height=\"456\" /></p>\r\n<p>We’re almost there gang… that halfway point between <a title=\"Final Fantasy XIV Topic\" href=\"https://www.mmobomb.com/topic/final-fantasy-xiv\">Final Fantasy XIV</a> expansions where everything from the last one wraps up and the story for the next part of the <a href=\"https://www.mmobomb.com/games/mmorpg\" target=\"_blank\" rel=\"noopener\">MMORPG</a> is set up over several patches. Today, during the latest Letter from the Producer Live, Yoshi-P offered players a look at what’s to come in Patch 6.4, “The Dark Throne” – as well as some of what to expect from 6.45. That means it loosely covered everything from the next stage of the MSQ to the next stage of Splendorous tools. As is generally the case, the stream was in Japanese with no translations other than the slides. So, we – once again – relied on the Final Fantasy XIV Discord channel for translations.</p>\r\n<p>First off… the date~ish. The Dark Throne is expected to drop in Late May. That means that everyone has around two months to wrap up whatever they’re doing before the next round of things to do are dropped in their lap.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-dungeon-812x456.jpg\" alt=\"Final Fantasy XIV Dungeon\" width=\"812\" height=\"456\" /></p>\r\n<p>As you might expect, we’re going to be spending some more time with Zero… doing exactly what, we’re not sure. It probably has something to do with the next dungeon, “The Aetherfont” and the new “The Voidcast Dais” trial. The former, once again, takes us to a snowy area, but it’s not all cold. As you can see from the images, there’s a very lush, green area in the background that gives a sort of Sharalayan or perhaps Dravanian Forelands vibe.</p>\r\n<p>Perhaps this is how we make our way back to the Thirteenth? It seems like that needs to happen as The Voidcast Dias seems to be where we’ll finally face Golbez and maybe rescue Azdaja.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-trial-812x456.jpg\" alt=\"Final Fantasy XIV Trial\" width=\"812\" height=\"456\" /></p>\r\n<p>Speaking of trials, a new unreal is on its way. That right. It’s time to head back to Containment Bay Z1T9. Get ready for the challenge… and the goodies you can earn if you do it often enough.</p>\r\n<p>Speaking of challenging content, 6.4 will drop the next round of Pandaemonium raids, Anabaseisos. As is now tradition, Savage will unlock a week later, so if you’re still working on P8S, you have – at the latest – until the first week of June before the next thing hits. On a side note, Yoshi-P commented on the previous (current) tier being a bit difficult. We have no idea what that means in regard to the difficulty level of the Anabaseisos Savage raids. It could mean they’ve made them easier, or he could have just been making a comment. Rewards for this tier will be revealed in the next live letter. Although, be prepared for new tomestones – the Allagan Tomestones of Comedy(?). Note that if you’re trying to gear, savage restrictions will be lifted this Tuesday.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-raid-812x456.jpg\" alt=\"Final Fantasy XIV Raid\" width=\"812\" height=\"456\" /></p>\r\n<p>For the \"not-so-casual casuals\" (read: your crafting and gathering crowd), there’s plenty to look forward to there as well. Ocean fishing is getting a new route that takes it towards Kugane. We’ll be spending more time with Tataru helping her with her plans for global corporate domination. (It looks like we’ll be dealing with Gaius this time and Yoshi-P suggests having done the Werlyt quest line before going into it.)</p>\r\n<p>Island Sanctuary is getting more. Players can expect new ranks and visions, a new gathering area, new construction plots, new rewards, materials, craftable items, animals, and structures. They’ll also be adding support for outdoor furnishings. (We’re one step closer to just being able to have a house on our islands.) They’ll allow 90 items max and they’ll have to be near structures. Note that special items like striking dummies and gardens are not supported.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-island-sanctuary-812x456.jpg\" alt=\"Final Fantasy XIV Island Sanctuary\" width=\"812\" height=\"456\" /></p>\r\n<p>For those wondering about when the next Manderville quest line and weapon upgrades will arrive, those will be dropping in 6.45. Also included in that patch will be the next tier of splendorous tools for the crafter/gatherer gang – perhaps with a dash of romance on the side, and the new Criterion Dungeon, Mount Rokkon. The dungeon will work the same as Sil’dihn Subterrane, although players don’t need to have done the former to do the latter. It makes sense. This one appears to take place in Othard somewhere.</p>\r\n<p>Okay, so here’s some big news for the other “not-so-casual” casuals. Blue Mages are getting love. Finally! When 6.4 hits, the Blues will get their level cap raised to 80, have new spells and gear added, and even have new enemies in the Masked Carnivale to fight.</p>\r\n<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/final-fantasy-xiv-fishing-812x456.jpg\" alt=\"Final Fantasy XIV Fishing\" width=\"812\" height=\"456\" /></p>\r\n<p>Patch 6.4 will also kick off PvP Series 4, Season 7 of Crystalline Conflict, and bring some changes to Frontline. The changes include a new UI element and adjustments to Fields of Glory. Borderland Ruins will be made temporarily unavailable – which may mean some serious work is being done there. Before all that, however, Season 6 of Crystalline Conflict will kick off this Tuesday with Patch 6.38.</p>\r\n<p>Wrapping this up, the stream also listed some other things that players can expect but the team didn’t offer a lot in the way of information on any of it. Of course, more Duty Support is being added. The 4.0 dungeons will be completed, leaving only the 4.x ones to go. There will be some (undisclosed) job adjustments. The devs are increasing the maximum number of gear sets to 100 and all gear sets will be unlocked from the start. This is to make glams easier. (Yoshi-P also noted that while he knows we all want more glam plates, it can’t be done just yet. That’s part of the reason they’re replacing data centers. (PRIORITIES!)</p>\r\n<p>Other random changes include making job icons display in chat for party and alliance as well as on player nameplates. Marketboard transaction fees can now be displayed in the total price. Glasses and wing fashion accessories will display in combat in the overworld. Items stored in multiple locations can now be selected when casting glamours in an inn room. And fairy glamours will be made available to Scholars.</p>\r\n<p>The rest of the stream focused on Fan Fest and all the goodies we can now buy. The stream actually kinda turned into the Home Shopping Network for XIV fans.</p>",
      "article_url": "https://www.mmobomb.com/news/final-fantasy-xiv-patch-6-4-will-bring-long-awaited-love-blue-mage-crowd"
    },
    {
      "id": 134086,
      "title": "Lots Of Weapon Changes Coming To Destiny 2, Mostly Buffs",
      "short_description": "This Week At Bungie included a preview of the mid-season update and an update of certain weapons.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/destiny-2-iterative-loop-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/destiny-2-iterative-loop.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/destiny-2-iterative-loop-812x456.jpg\" alt=\"destiny 2 Iterative Loop\" width=\"812\" height=\"456\" /></p>\r\n<p>Another week, another “This Week at Bungie.”</p>\r\n<p>Yesterday’s edition included a preview of <a href=\"https://www.mmobomb.com/topic/destiny-2\">Destiny 2’s</a> mid-season update, an address of a question about a specific weapon, and a behind-the-scenes look at placeholder animations for that gun.</p>\r\n<p>The team has adjusted the damage of various weapon types against red- and orange-bar enemies in PvE content. Auto Rifles, Pulse Rifles, Hand Cannons, and Sidearms have received a 25%, 20%, 20%, and 20% increase in damage, respectively, while Scout Rifles have been given a 10% boost. SMGs and Bows were used as benchmarks for tuning, and Bungie plans to continue monitoring the primary weapon balance in PvE and may make further adjustments in the future.</p>\r\n<p>Also, the IKELOS submachine gun is being adjusted to have more recoil in line with other SMGs, and a larger change will reduce the damage of the Aggressive Frame SMG sub-family. The Rapid-Fire Frame Fusion Rifles are getting a damage boost and the Trace Rifles are getting a small damage increase and a boost to stability at high stats. Rapid-Fire Frame Sniper Rifles are also being adjusted with reduced recoil and increased ammo capacity.</p>\r\n<p>Additionally, three exotic weapons are getting tweaks. Final Warning can no longer track targets through Titan Barricades, Tarrabah will generate less energy when taking damage and has reduced zoom, and Revision Zero's Fourth Times the Charm perk will be reset when entering Hunter's Trace, and PvE damage of the Hunter's Trace and Häkke Heavy Burst rounds will be increased. </p>\r\n<p>There's more, too! The team said they reduced the difficulty of Legend and Master activities in Destiny 2 by reducing enemy HP scalar and co-op enemy HP scalar in Legendary Avalon. Bungie also decreased Commendation requirements and removed some Guardian Rank objectives. For full details, check out <a href=\"https://www.bungie.net/7/en/News/article/destiny-2-twab-3-30-23\">the blog post</a>.</p>",
      "article_url": "https://www.mmobomb.com/news/lots-of-weapon-changes-coming-to-destiny-2-mostly-buffs"
    },
    {
      "id": 134087,
      "title": "New Season Coming To Trackmania Plus Free Spring 2023 Campaign",
      "short_description": "Ubisoft's racing game is getting new tracks, medals, skins, trophies, and blocks.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/trackmania-royal-mode-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/trackmania-royal-mode.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/trackmania-royal-mode-812x456.jpg\" alt=\"trackmania royal mode\" width=\"812\" height=\"456\" /></p>\r\n<p>Ubisoft announced yesterday, <a href=\"https://www.gamespress.com/en-US/TRACKMANIA-SPRING-2023-CAMPAIGN-AVAILABLE-FOR-FREE-ON-1-ST-APRIL\">via press release</a>, that a new season and the free Spring 2023 campaign is coming to their <a href=\"https://www.mmobomb.com/games/racing\" target=\"_blank\" rel=\"noopener\">racing</a> game, Trackmania, on April 1.</p>\r\n<p>The racing game is getting 25 new tracks and 100 medals to earn. Players can unlock a fresh evolutive Prestige Skin by beating both the campaign and the Track Of The Day’s medals. Also, there will be over 150 original blocks available in the track editor.</p>\r\n<p>Fortunately, those who have been grinding out the Winter 2023 campaign will receive trophies according to the final rank they achieved, and the greatest Trackmania World Tour teams will earn points to qualify for the World Championship.</p>",
      "article_url": "https://www.mmobomb.com/news/new-season-coming-to-trackmania-plus-free-spring-2023-campaign"
    },
    {
      "id": 134085,
      "title": "Shroud of the Avatar: Forsaken Virtues, \"The Spiritual Successor To Ultimate Online,\" Gets Big Update",
      "short_description": "Release 112 is live now, featuring loads of new content and game improvements.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/shroud-of-avatar-port-of-harmony-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/shroud-of-avatar-port-of-harmony.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/shroud-of-avatar-port-of-harmony-812x456.jpg\" alt=\"shroud of the avatar port of harmony\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.mmobomb.com/topic/shroud-of-the-avatar\" target=\"_blank\" rel=\"noopener\">Shroud of the Avatar</a>: Forsaken Virtues got another update. (In case you weren’t aware, this multiplayer fantasy RPG by Catnip Games is “the spiritual successor to Ultima Online,” according to the Steam page.)</p>\r\n<p>The patch, Release 112, is currently live. It features loads of new content and improvements to the game. There are changes in crafting, decoration, items, combat, skills, quests, and the world itself. There are several quality of life improvements, too. Players may also get login rewards if they are a part of the rewards program.</p>\r\n<p>Last but not least, while not in this update, the development team offered a sneak peek at the new Port of Harmony area. Read the full patch notes <a href=\"https://www.shroudoftheavatar.com/?p=132317#more-132317\">on the official site</a>.</p>",
      "article_url": "https://www.mmobomb.com/news/shroud-of-avatar-forsaken-virtues-spiritual-successor-to-ultimate-online-gets-big-update"
    },
    {
      "id": 134084,
      "title": "Surprise! E3 Is Canceled… Again",
      "short_description": "We’re shocked… well, really not that shocked.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/e3-2023-canceled-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/e3-2023-canceled.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/e3-2023-canceled-812x456.jpg\" alt=\"E3 2023 Canceled\" width=\"812\" height=\"456\" /></p>\r\n<p>Following news that <a href=\"https://www.mmobomb.com/news/ubisoft-pulls-out-of-e3\" target=\"_blank\" rel=\"noopener\">Ubisoft decided not to attend</a> E3 – in favor of hosting their own event in the same town at the same time – the ESA has announced the decision to cancel the event. This year’s E3 was intended to be the expo’s big return to a physical space after being held digitally or not at all over the last three years. Unfortunately for them, things just haven’t gone their way.</p>\r\n<p>When the ESA first announced the return of E3, it was without the support of the Big 3 – Sony, Microsoft, and Nintendo. However, Ubisoft signed on. But, the developer just didn’t stay committed and <a title=\"Ubisoft Withdraws From E3\" href=\"https://www.mmobomb.com/news/ubisoft-pulls-out-of-e3\">withdrew last week</a>, revealing they’d be holding their own event in LA instead.</p>\r\n<p>Whether or not that’s the last straw might be up for debate, but the result is the same. Today, the ESA canceled E3 2023. The organization hasn’t gotten around to updating its website yet, but they’ve already sent out an email to those who applied for press passes letting them know that the event will not be taking place this year. In addition, following <a title=\"IGN E3 Canceled\" href=\"https://www.ign.com/articles/e3-has-been-canceled\" target=\"_blank\" rel=\"noopener\">a report on IGN</a>, the ESA and ReedPop issued a statement confirming the event’s cancellation.</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"und\">ESA/ReedPop's statement on E3 <a href=\"https://t.co/AAowpzPP2g\">pic.twitter.com/AAowpzPP2g</a></p>\r\n— Wario64 (@Wario64) <a href=\"https://twitter.com/Wario64/status/1641547714193391617?ref_src=twsrc%5Etfw\">March 30, 2023</a></blockquote>\r\n<p>\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</p>\r\n<p>That's yet another year the event has just been straight-up canceled. It’ll be interesting to see if the ESA makes another attempt in 2024.</p>",
      "article_url": "https://www.mmobomb.com/news/surprise-e3-canceled-again"
    },
    {
      "id": 134083,
      "title": "Conqueror's Blade And Naraka: Bladepoint Team Up For Crossover Event",
      "short_description": "Rifts will brink Naraka’s battle royale to Conqueror’s Blade.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/naraka-bladepoint-conquerors-blade-crossover-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/naraka-bladepoint-conquerors-blade-crossover.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/naraka-bladepoint-conquerors-blade-crossover-812x456.jpg\" alt=\"Naraka Bladepoint Conquerors Blade Crossover\" width=\"812\" height=\"456\" /></p>\r\n<p><a title=\"Naraka: Bladepoint Topic\" href=\"https://www.mmobomb.com/topic/naraka-bladepoint\">Naraka: Bladepoint</a> is seeping into <a title=\"Conqueror's Blade Game Page\" href=\"https://www.mmobomb.com/review/conquerors-blade\">Conqueror’s Blade</a> via rifts and the warlords of Conqueror’s Blade are going to have to stop it. This is all part of a new <a title=\"Conqueror's Blade Naraka: Bladepoint Crossover\" href=\"https://conqblade.com/en/news/2515-conqueror-s-blade-x-naraka-bladepoint-event\" target=\"_blank\" rel=\"noopener\">crossover</a> between the two games, which introduces a new limited-time mode titled Riot Act. This mode will pit players against each other as the prisoners of the ‘Wolf Cages’ are driven insane by the Rifts. The sides are split into the prisoners gone mad or the guards intending to prevent it.</p>\r\n<p>Taking part in the limited-time mode will earn players rewards, including new Naraka: Bladepoint-inspired hero attire. The event runs through April 13, so players have plenty of time to earn their rewards.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/eUax5NP7bQs\" title=\"YouTube video player\" width=\"709\" height=\"418\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/conquer-blade-naraka-bladepoint-team-up-crossover-event"
    },
    {
      "id": 134082,
      "title": "Marvel Snap Disables Kitty Pryde Due To Crash Issue",
      "short_description": "She can make your whole game disappear.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/marvel-snap-kitty-pryde-disabled-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/marvel-snap-kitty-pryde-disabled.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/marvel-snap-kitty-pryde-disabled-812x456.jpg\" alt=\"marvel snap kitty pryde disabled\" width=\"812\" height=\"456\" /></p>\r\n<p><a href=\"https://www.mmobomb.com/review/marvel-snap\" target=\"_blank\" rel=\"noopener\">Marvel Snap</a> has temporarily had to disable Kitty Pryde due to an issue that can cause the game to crash when playing against her. Players are now unable to queue into matches with Kitty Pryde in their deck and she will not show up in card rotations in the Token shop. Players will receive an error message when trying to purchase the card.</p>\r\n<blockquote class=\"twitter-tweet tw-align-center\">\r\n<p dir=\"ltr\" lang=\"en\">An update regarding Kitty Pryde <a href=\"https://t.co/FoBIqoezti\">pic.twitter.com/FoBIqoezti</a></p>\r\n— MARVEL SNAP (@MARVELSNAP) <a href=\"https://twitter.com/MARVELSNAP/status/1641501279129313280?ref_src=twsrc%5Etfw\">March 30, 2023</a></blockquote>\r\n<p><span style=\"color: #a69f93; font-family: 'Helvetica Neue', sans-serif; font-size: 12px; text-align: center; white-space: nowrap; background-color: #181a1b; --darkreader-inline-color: #aaa297; --darkreader-inline-bgcolor: #131516;\" data-darkreader-inline-color=\"\" data-darkreader-inline-bgcolor=\"\">\r\n<script src=\"https://platform.twitter.com/widgets.js\"></script>\r\n</span></p>\r\n<p>Some sort of compensation will be coming in the future according to the Tweet, but that hasn't stopped some players from asking for their credits back for the Marvel Snap card. Kitty Pryde will be coming back once the issue can be resolved.</p>",
      "article_url": "https://www.mmobomb.com/news/marvel-snap-disables-kitty-pryde-due-to-crash-issue"
    },
    {
      "id": 134079,
      "title": "Path Of Exile’s: Crucible Expansion Will Introduce Skill Trees For Weapons",
      "short_description": "Players will also be able to travel instantly using Atlas Gateways.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/path-of-exile-crucible-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/path-of-exile-crucible.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/path-of-exile-crucible-812x456.jpg\" alt=\"Path Of Exile Crucible\" width=\"812\" height=\"456\" /></p>\r\n<p>Today, Grinding Gear Games hosted a <a title=\"Path of Exile Game Page\" href=\"https://www.mmobomb.com/review/path-of-exile\">Path of Exile</a> livestream introducing the game’s next expansion, Crucible. The new expansion launched on April 7 on PC. Consoles will have to wait a few days to start playing it on April 12.</p>\r\n<p>When it launches, the new update will introduce several bits of new content. Of course, there’s the new league – the Crucible Challenge League. This new league will implement a big change in the game’s item system, allowing players to augment their weapons using skill trees specific to them. These trees will help improve a character’s playstyle and offer powerful effects. There is a cost, however. The trees consume experience from Crucible encounters.</p>\r\n<p>Another big addition is the Atlas Gateway system. This is a new feature in the endgame, introducing nodes that allow players to instantly travel between two locations in the Atlas Passive Tree. This should allow players to better focus on the content they want. The devs have also revamped the Breach and Abyss mechanics, reducing clutter and improving gameplay. And, the Passive Tree and Masteries have been reworked, adding new Masteries that will provide more interesting effects.</p>\r\n<p><iframe src=\"https://www.youtube.com/embed/TGn5NzGwqKw\" title=\"YouTube video player\" width=\"709\" height=\"418\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/path-of-exile-crucible-expansion-will-introduce-skill-trees-weapons"
    },
    {
      "id": 134080,
      "title": "Operation: Accolade Is Out Now For Insurgency: Sandstorm, Includes Fan-Made Map",
      "short_description": "New map, weapons, cosmetics, and more.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/insurgency-sandstorm-operation-accolade-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/insurgency-sandstorm-operation-accolade.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/insurgency-sandstorm-operation-accolade-812x456.jpg\" alt=\"Insurgency Sandstorm Operation Accolade\" width=\"812\" height=\"456\" /></p>\r\n<p>Operation: Accolade is the final major Year 2 content update for <a href=\"https://www.mmobomb.com/games/shooter\" target=\"_blank\" rel=\"noopener\">FPS</a> <a href=\"https://www.mmobomb.com/topic/insurgency-sandstorm\" target=\"_blank\" rel=\"noopener\">Insurgency: Sandstorm</a>, and with it comes a new map, weapons, character cosmetics, and a free update to the game.</p>\r\n<p>Last Light is the new map that has been adapted from the fan-favorite submission to the Insurgency: Sandstorm mapping contest. Players can enter and utilize building interiors and explore the entirely new marine yacht area. The new map is a luxurious coastal town setting, likened to something such as Monte Carlo.</p>\r\n<p>New weapons included in the free update are the Micro Dynamic Rifle (MDR) for Security forces and the SG 552 for Insurgents. New gear sets include the Scout set for Security and the Rebel set for Insurgents.</p>\r\n<p>For new premium content, players can choose between the Worn Veteran weapon skin pack and the Rust &amp; Wrap pack. New gear sets are the Pilot and Biker.</p>\r\n<p>Insurgency: Sandstorm and the Operation: Accolade update are currently live on Steam, Epic, PlayStation, and Xbox. </p>\r\n<p><iframe src=\"https://www.youtube.com/embed/XaduTPO3EFU\" title=\"YouTube video player\" width=\"560\" height=\"315\" allowfullscreen=\"allowfullscreen\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\"></iframe></p>",
      "article_url": "https://www.mmobomb.com/news/operation-accolade-out-now-insurgency-sandstorm-includes-fan-made-map"
    },
    {
      "id": 134078,
      "title": "Evil Dead: The Game Will Finally Launch On Steam With The Release Of The Game Of The Year Edition",
      "short_description": "Players can wishlist the game now and save on several DLC packs.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/evil-dead-game-goty-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/evil-dead-game-goty.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/evil-dead-game-goty-812x456.jpg\" alt=\"Evil Dead: The Game GOTY\" width=\"812\" height=\"456\" /></p>\r\n<p><a title=\"Evil Dead: The Game Topic\" href=\"https://www.mmobomb.com/topic/evil-dead\">Evil Dead: The Game</a> is getting its own Game of the Year Edition, and it’s getting it soon. In fact, the new edition of the <a href=\"https://www.mmobomb.com/games/survival\" target=\"_blank\" rel=\"noopener\">asymmetric title</a> will be available on consoles and Steam April 26. Those wanting to <a title=\"Evil Dead: The Game GOTY\" href=\"https://store.steampowered.com/app/1493750/Evil_Dead_The_Game/\" target=\"_blank\" rel=\"noopener\">grab the game on Valve’s platform</a> can even wish list the game now and lock in special deals on six DLC packs, including the “Who’s Your Daddy?” bundle.</p>\r\n<p>The new bundle, inspired by the STARZ series “Ash vs Evil Dead” includes a new survivor, a new demon, and new outfits. The new survivor, Ash’s dad Brock, is immune to knockbacks and can use several auras that change dynamically based on how many members of the Williams family are on the team to help his squad mates. The demon, Schemer, is based on the demon boss Baal and is a trap specialist that confuses Survivors with illusions. As for the outfits, there are new ones for Ash, Amanda, and Pablo.</p>",
      "article_url": "https://www.mmobomb.com/news/evil-dead-game-will-finally-launch-steam-release-of-game-of-year-edition"
    },
    {
      "id": 134076,
      "title": "Get \"Egg-cited\" For Fortnite's Next Major Update, \"Spring Breakout\"",
      "short_description": "There's plenty of new rewards and the Island is now covered in cherry blossoms and spring chickens.",
      "thumbnail": "https://www.mmobomb.com/file/2023/3/fortnite-spring-chicken-218x150.jpg",
      "main_image": "https://www.mmobomb.com/file/2023/3/fortnite-spring-chicken.jpg",
      "article_content": "<p><img class=\"type:primaryImage aligncenter size-large\" src=\"https://www.mmobomb.com/file/2023/3/fortnite-spring-chicken-812x456.jpg\" alt=\"fortnite spring chicken\" width=\"812\" height=\"456\" /></p>\r\n<p>Are you egg-cited for <a href=\"https://www.mmobomb.com/review/fortnite-battle-royale\">Fortnite’s</a> first major update for Chapter 4 Season 2?</p>\r\n<p>Starting April 11, the Spring Breakout begins in the <a href=\"https://www.mmobomb.com/games/battle-royale\" target=\"_blank\" rel=\"noopener\">battle royale</a>. By completing quests, players will earn XP and rewards such as the Bloomback Sack Back Bling, the Shell Smash Spray, The Works Loading Screen, the Spring Breakout Banner Icon, the Nannerbloom Hammer Pickaxe, and the Fresh Flyer Glider.</p>\r\n<p>Also, the island got a makeover. It’s now covered in cherry blossoms and spring chickens. The green and purple ones lay special eggs that provide players with temporary benefits upon interaction. Green eggs restore health and shield over time, blue ones grant low gravity and health, and golden eggs give Bars.</p>\r\n<p>Players can find the Egg Launcher from the ground, chests, supply drops, for sale, or from the new Springtime Blowout Reality Augment.</p>\r\n<p>Additionally, Epic Games added four Reality Augments to the battle royale game: Rail Warrior, Go For Broke, Aquatic Warrior, and Game Time. There’s eight Specialist Characters available, too, featuring four different types: Scout, Heavy, Supply, and Medical.</p>\r\n<p>And there’s even more content not mentioned here, so check out the full details <a href=\"https://www.fortnite.com/news/fortnite-battle-royale-v24-10-let-your-eggcitement-bloom-during-spring-breakout-2023?sessionInvalidated=true\">in the latest blog</a>, including bug fixes and other changes.</p>",
      "article_url": "https://www.mmobomb.com/news/get-eggcited-fortnite-next-major-update-spring-breakout"
    }
  ]
}
